[
  {
    "Common Name": "Asian Elephant",
    "Scientific Name": "Elephas maximus maximus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Charges, trumpets loudly, flares ears, and may use tusks and trunk for attack.",
    "If Attacked": "Seek immediate shelter behind a large tree or rock. If no cover is available, run in a zig-zag pattern.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Found throughout the island, but with higher concentrations in dry zone areas such as Udawalawe, Yala, and Minneriya National Parks.",
    "Venom Type": "None",
    "Description": "The Sri Lankan elephant (Elephas maximus maximus) is the largest and most iconic land mammal in Sri Lanka. Characterized by its smaller ears, less prominent tusks (often absent in females), and a distinctive depigmentation pattern on the trunk, ears, and face, this subspecies plays a vital role in its ecosystem as a seed disperser and ecosystem engineer. They inhabit a variety of habitats, from dense forests to open grasslands, and are herbivores, consuming large quantities of vegetation daily.  Their populations, however, face continuous threats due to habitat loss and human-elephant conflict."
  },
  {
    "Common Name": "Sri Lankan Leopard",
    "Scientific Name": "Panthera pardus kotiya",
    "Poison Level": "Non-Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "May exhibit warning signs such as growling, hissing, flattened ears, and tail twitching.  Likely to charge if cornered or threatened.",
    "If Attacked": "Make yourself appear large, shout loudly, and fight back aggressively. Do not play dead.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Island-wide, but higher densities in Yala and Wilpattu National Parks. Also found in various protected areas and even some human-dominated landscapes.",
    "Venom Type": "None",
    "Description": "The Sri Lankan leopard (Panthera pardus kotiya) is a powerful and elusive big cat endemic to Sri Lanka.  Distinguished by its tawny coat with dark rosettes, it occupies a diverse range of habitats, from dense rainforests to dry scrublands and even montane forests. As the apex predator in its ecosystem, the Sri Lankan leopard plays a crucial role in regulating prey populations, primarily consisting of sambar deer, spotted deer, wild boar, and monkeys.  Habitat loss and human-wildlife conflict are the biggest threats to this magnificent animal."
  },
  {
    "Common Name": "Sloth Bear",
    "Scientific Name": "Melursus ursinus inornatus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Highly aggressive, stands on hind legs, roars loudly, may charge.",
    "If Attacked": "Climb a tree or large rock if possible.  If unable, play dead and protect your head and neck. Do not run.",
    "Category": "Mammal",
    "Endemic": "Yes (Sri Lankan subspecies)",
    "Region": "Dry zone, including North Western, North Central, Eastern, and parts of Uva provinces.",
    "Venom Type": "None",
    "Description": "The Sri Lankan sloth bear (Melursus ursinus inornatus) is a subspecies of sloth bear endemic to Sri Lanka. Characterized by its shaggy, dark brown or black fur, long snout, and white \"V\" or \"Y\" marking on the chest, it's adapted for a diet of insects, especially termites and bees, which it locates with its keen sense of smell and excavates with powerful claws. Sloth bears inhabit dry forests, scrublands, and grasslands, playing a role in seed dispersal and insect population control. They are primarily nocturnal and solitary, except for mothers with cubs.  Habitat loss and human-wildlife conflict pose significant threats to their survival."
  },
  {
    "Common Name": "Wild Boar",
    "Scientific Name": "Sus scrofa",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "Becomes aggressive, charges, and uses tusks to inflict injury. May make loud grunting noises and display piloerection (raised hair).",
    "If Attacked": "Climb a tree or large rock if possible. If not possible, stand your ground and make yourself appear large and intimidating, shouting and waving your arms. Do not run away unless you are certain you can reach a safe distance quickly.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Island-wide, including all provinces, from coastal areas to higher elevations.",
    "Venom Type": "None",
    "Description": "The Sri Lankan wild boar (Sus scrofa) is a robust, medium-sized mammal with a thick, bristly coat that varies in color from brownish-black to reddish-brown.  They possess a prominent snout used for rooting in the ground for food. Males are generally larger than females and have prominent tusks protruding from their lower jaw.  Inhabiting a wide range of habitats including forests, grasslands, and scrublands, they are omnivorous, consuming fruits, roots, tubers, insects, and small vertebrates.  Wild boar play a crucial role in seed dispersal and nutrient cycling within their ecosystem, but can also cause crop damage and compete with domestic livestock for resources."
  },
  {
    "Common Name": "Sambar Deer",
    "Scientific Name": "Rusa unicolor",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "May charge, especially if cornered or protecting young.  Can inflict serious injury with antlers and hooves.",
    "If Attacked": "Climb a tree or find other high ground. If impossible, curl into a fetal position and protect your head.",
    "Category": "Mammal",
    "Endemic": "Yes, Sri Lankan Sambar (Rusa unicolor unicolor) is a subspecies endemic to Sri Lanka.",
    "Region": "Throughout the island, including dry zone, wet zone, and montane forests.",
    "Venom Type": "None",
    "Description": "The Sri Lankan Sambar deer is the largest deer in Sri Lanka, characterized by its coarse, dark brown coat and impressive antlers in males. They inhabit a variety of habitats from dense forests to open grasslands and are primarily herbivorous, feeding on grasses, leaves, fruits, and bark. As a large herbivore, the Sambar plays a crucial role in the ecosystem by shaping vegetation and serving as prey for large predators like leopards and crocodiles.  Their presence indicates a healthy ecosystem.  Hunting and habitat loss are major threats to their population."
  },
  {
    "Common Name": "Spotted Deer   Chital",
    "Scientific Name": "Axis axis ceylonensis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May charge if cornered or protecting young.  Typically flee when threatened.",
    "If Attacked": "Stand your ground, shout, and make yourself appear large.  Slowly back away.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Throughout the dry zone, particularly in national parks like Yala, Wilpattu, and Udawalawe.",
    "Venom Type": "None",
    "Description": "The Sri Lankan spotted deer, or Ceylon spotted deer (Axis axis ceylonensis), is a subspecies of chital deer endemic to Sri Lanka. These graceful herbivores are easily recognized by their reddish-brown coat adorned with white spots, which provide excellent camouflage in dappled forest light.  They inhabit dry zone forests, grasslands, and scrublands, playing a vital role in the ecosystem as both grazers and prey for larger predators like leopards and crocodiles.  They are social animals, living in herds of varying sizes."
  },
  {
    "Common Name": "Muntjac   Barking Deer",
    "Scientific Name": "Muntiacus muntjak malabaricus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May bark loudly, stamp feet, and display tusks (males). Can charge if cornered.",
    "If Attacked": "Stand your ground, make yourself appear large, and shout.  Slowly back away without turning your back.",
    "Category": "Mammal",
    "Endemic": "Yes (subspecies *Muntiacus muntjak malabaricus*)",
    "Region": "Wet zone forests, particularly in the southwestern regions (Sabaragamuwa and Southern).",
    "Venom Type": "None",
    "Description": "The Sri Lankan muntjac, or barking deer, is a small deer species recognizable by its reddish-brown coat, small antlers in males, and prominent tusks. They inhabit dense, humid forests, often near water sources.  Primarily browsers, they feed on leaves, fruits, and grasses, playing a role in seed dispersal and vegetation control. Their distinctive bark serves as an alarm call, warning other animals of potential danger. They are solitary or found in small family groups."
  },
  {
    "Common Name": "Mouse Deer   Chevrotain",
    "Scientific Name": "Moschiola meminna",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May flee quickly or freeze, possibly stamping their feet.  Males may use their tusks if cornered.",
    "If Attacked": "Give it space to escape.  Their tusks can cause minor injury.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Throughout the island, but more common in dry zone forests and scrublands.",
    "Venom Type": "None",
    "Description": "The Sri Lankan mouse-deer, or chevrotain, *Moschiola meminna*, is a small, hoofed mammal resembling a tiny deer but more closely related to camels and pigs.  They are shy and solitary creatures, predominantly nocturnal, preferring dense undergrowth in a variety of habitats, from forests and grasslands to home gardens. They are herbivorous, feeding on fruits, leaves, and shoots, playing a vital role in seed dispersal.  Males possess small tusks used for defense and competition during mating season.  Their reddish-brown coat provides excellent camouflage in their environment. While hunted for meat in some areas, they remain a relatively common sight in Sri Lanka."
  },
  {
    "Common Name": "Toque Macaque",
    "Scientific Name": "Macaca sinica",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "May display aggressive behaviors like baring teeth, charging, or throwing objects.",
    "If Attacked": "Avoid eye contact, back away slowly without making sudden movements, and do not try to feed or interact with the macaque. Seek medical attention if bitten.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Throughout the island, but more common in forested areas of all regions including dry zone, wet zone, and hill country.",
    "Venom Type": "None",
    "Description": "The Toque Macaque (Macaca sinica), recognizable by its reddish-brown fur and prominent \"toque\" of hair on its head, is a highly adaptable primate found across various habitats in Sri Lanka, from urban areas to rainforests.  These diurnal omnivores play a vital role in seed dispersal and forest regeneration, consuming fruits, leaves, insects, and small vertebrates.  They live in complex social groups with hierarchical structures, often exhibiting opportunistic and sometimes aggressive behavior when seeking food or defending territory.  Their adaptability and resourcefulness have allowed them to thrive despite habitat loss and human encroachment, but also lead to human-wildlife conflict."
  },
  {
    "Common Name": "Grey Langur   Hanuman Langur",
    "Scientific Name": "Semnopithecus priam thersites",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May display aggressive postures like baring teeth, shaking branches, and loud vocalizations.  Troops may throw objects.",
    "If Attacked": "Maintain distance, avoid eye contact, and back away slowly. Do not threaten or corner them.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Dry Zone (North Western, North Central, Eastern, and parts of Uva)",
    "Venom Type": "None",
    "Description": "The Grey Langur or Hanuman Langur (Semnopithecus priam thersites) is a slender, long-tailed primate endemic to Sri Lanka's dry zone. They possess a greyish-brown coat with a darker face and a whitish ruff around the face. Primarily arboreal, these diurnal herbivores inhabit forests, woodlands, and even urban areas. They play a vital role in seed dispersal and forest regeneration. Troops, consisting of multiple females and a dominant male, maintain a complex social structure. While generally peaceful, they can become agitated if they feel threatened, particularly near their young."
  },
  {
    "Common Name": "Purple-faced Langur",
    "Scientific Name": "Trachypithecus vetulus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May display aggressive vocalizations, bare their teeth, and shake branches.",
    "If Attacked": "Slowly back away while avoiding direct eye contact. Do not make sudden movements.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Throughout the island, but with distinct subspecies in different regions (Wet Zone, Dry Zone, Hill Zone).",
    "Venom Type": "None",
    "Description": "The Purple-faced Langur ( *Trachypithecus vetulus* ) is a slender Old World monkey with a distinctive dark face,  framed by grayish-white fur.  They inhabit various forest types in Sri Lanka, including rainforests, dry zone forests, and even urban areas. Primarily herbivorous, they feed on leaves, fruits, and flowers, playing a crucial role in seed dispersal.  Different subspecies exhibit variations in coat color and facial markings.  While generally shy, habitat loss and human encroachment have led to increased interactions with humans, sometimes resulting in defensive displays."
  },
  {
    "Common Name": "Golden Palm Civet",
    "Scientific Name": "Paradoxurus zeylonensis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May hiss, growl, arch its back, and release a foul-smelling secretion from its anal glands.",
    "If Attacked": "Give it space to escape.  If cornered, defend yourself cautiously.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Throughout the island, but primarily in forested areas including lowland rainforests, montane forests, and even home gardens.",
    "Venom Type": "None",
    "Description": "The Golden Palm Civet (Paradoxurus zeylonensis), a nocturnal and arboreal mammal, is endemic to Sri Lanka.  Its golden-brown fur, often with darker markings, provides excellent camouflage in the dense foliage of its habitat.  Primarily frugivorous, the civet plays a crucial role in seed dispersal, contributing to the regeneration of forests.  It also consumes insects, small vertebrates, and eggs, adding to its ecological importance.  Although generally shy and elusive, habitat loss and human encroachment are increasing interactions, sometimes leading to conflict."
  },
  {
    "Common Name": "Small Indian Civet",
    "Scientific Name": "Viverricula indica",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May hiss, growl, and release a foul-smelling secretion from its perineal glands.",
    "If Attacked": "Give it space to escape. Wash thoroughly any area bitten.  Seek medical advice if necessary due to the risk of bacterial infection.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Throughout the island, including forested areas, scrublands, and even close to human settlements.",
    "Venom Type": "None",
    "Description": "The Small Indian Civet ( *Viverricula indica* ) is a slender, nocturnal mammal with a pointed face, long tail with black and white rings, and a grayish-brown coat with dark spots or stripes. It inhabits a variety of habitats in Sri Lanka, from forests and scrublands to agricultural areas and even near human dwellings.  This omnivorous civet plays a vital role in seed dispersal and insect control, feeding on fruits, insects, small rodents, reptiles, and birds. It is known for its production of civetone, a musk-like secretion used in perfumery, though it's important to note ethical concerns surrounding its extraction.  While generally shy and elusive, they can be defensive if cornered."
  },
  {
    "Common Name": "Common Palm Civet   Toddy Cat",
    "Scientific Name": "Paradoxurus hermaphroditus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Hisses, growls, arches its back, and may release a pungent musk from its anal glands.",
    "If Attacked": "Give it space to escape.  If cornered, defend yourself cautiously while trying to create an escape route for the animal. Medical attention is rarely needed unless significantly bitten.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Island-wide, including various habitats from forests to urban areas.",
    "Venom Type": "None",
    "Description": "The Common Palm Civet, also known as the Toddy Cat, is a nocturnal mammal with a sleek, greyish-brown coat, pointed face, and a long, ringed tail.  It's well adapted to arboreal life, found in a range of habitats across Sri Lanka, from forests and plantations to urban gardens.  Primarily frugivorous, it plays a role in seed dispersal, contributing to forest regeneration.  While it also consumes insects, small vertebrates, and eggs, its fondness for palm flower sap gives it its \"Toddy Cat\" nickname.  Though generally shy and non-aggressive, it can emit a foul-smelling secretion when threatened."
  },
  {
    "Common Name": "Striped-necked Mongoose",
    "Scientific Name": "Herpestes vitticollis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May hiss, growl, and arch its back.  Likely to flee rather than attack unless cornered.",
    "If Attacked": "Give it space to escape. If bitten, seek medical attention for potential bacterial infection.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Wet Zone and some parts of the intermediate zone. Particularly found near water bodies in forested areas.",
    "Venom Type": "None",
    "Description": "The Striped-necked Mongoose (Herpestes vitticollis) is a large, robust mongoose species endemic to Sri Lanka. It is characterized by a distinctive dark stripe running along the sides of its neck and shoulders, contrasting with its otherwise grizzled brown to reddish-brown fur.  This semi-aquatic mongoose is well-adapted to life near rivers, streams, and marshes within forested areas.  Its diet consists mainly of crabs, frogs, fish, and other small vertebrates.  The Striped-necked Mongoose plays an essential role in its ecosystem as a predator, regulating populations of its prey species."
  },
  {
    "Common Name": "Indian Grey Mongoose",
    "Scientific Name": "Herpestes edwardsii",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May hiss, growl, arch its back, and raise its tail.  Can become aggressive if cornered.",
    "If Attacked": "Back away slowly and avoid sudden movements.  If bitten, seek medical attention for potential bacterial infection.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Throughout the island, including various habitats from dry zone forests to urban areas.",
    "Venom Type": "None",
    "Description": "The Indian grey mongoose is a small, agile carnivore with a grizzled grey-brown coat, a pointed snout, and a long, bushy tail.  They are opportunistic feeders, consuming a wide variety of prey including rodents, snakes, lizards, insects, and even fruit.  In Sri Lanka, they inhabit a range of environments, from forests and grasslands to agricultural lands and urban areas, demonstrating adaptability.  As a predator, the mongoose plays an important role in controlling rodent populations and contributes to the overall balance of the ecosystem."
  },
  {
    "Common Name": "Ruddy Mongoose",
    "Scientific Name": "Herpestes smithii",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May hiss, growl, arch its back, and raise its fur.  Likely to flee rather than attack unless cornered.",
    "If Attacked": "Back away slowly and avoid sudden movements.  If bitten, seek medical attention for potential bacterial infection.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Widespread throughout the island, including dry zone, wet zone, and hill country.",
    "Venom Type": "None",
    "Description": "The Ruddy Mongoose ( *Herpestes smithii*) is a reddish-brown, medium-sized carnivorous mammal endemic to Sri Lanka and India.  It has a long, bushy tail and relatively short legs.  Inhabiting a variety of environments, including forests, scrublands, and grasslands, it is a diurnal predator, primarily feeding on rodents, snakes, lizards, insects, and occasionally fruits.  The Ruddy Mongoose plays an important role in controlling rodent populations and contributes to the health of the ecosystem. They are generally solitary or found in pairs, and are known for their agility and sharp senses."
  },
  {
    "Common Name": "Indian Pangolin",
    "Scientific Name": "Manis crassicaudata",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Curls into a tight, armored ball. May hiss and thrash its tail.",
    "If Attacked": "Give it space and allow it to retreat. Do not attempt to handle it.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Dry Zone, including North Western, Northern, and parts of Eastern provinces.  Also sparsely found in some areas of the wet zone.",
    "Venom Type": "None",
    "Description": "The Indian pangolin (Manis crassicaudata) is a unique, scaly mammal specializing in myrmecophagy (ant and termite consumption). Covered in overlapping keratin scales, it uses its powerful claws to dig into ant and termite mounds, extracting its prey with a long, sticky tongue. Nocturnal and solitary by nature, the Indian pangolin plays a crucial role in controlling insect populations within its ecosystem.  They prefer habitats such as dry forests, grasslands, and scrublands, but ongoing habitat loss and poaching for their scales and meat pose serious threats to their survival in Sri Lanka."
  },
  {
    "Common Name": "Indian Porcupine",
    "Scientific Name": "Hystrix indica",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "Raises its quills, makes grunting and rattling noises, and may charge backward into the perceived threat using its quill-covered tail.",
    "If Attacked": "Back away slowly and avoid sudden movements. Do not attempt to touch or corner the animal. Seek medical attention if injured by quills.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Throughout the island, including dry zone, intermediate zone, and parts of the wet zone.",
    "Venom Type": "None",
    "Description": "The Indian Porcupine ( *Hystrix indica* ) is a large rodent characterized by its long, sharp quills. These quills are modified hairs that serve as a formidable defense mechanism against predators like leopards and jackals.  They are nocturnal and primarily herbivorous, feeding on roots, tubers, bark, fruits, and crops.  Indian Porcupines play a role in seed dispersal and soil aeration through their digging activities.  They inhabit a variety of habitats from scrublands and forests to agricultural areas and even near human settlements, demonstrating their adaptability."
  },
  {
    "Common Name": "Indian Flying Fox",
    "Scientific Name": "Pteropus giganteus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May screech, bare teeth, and attempt to bite if cornered or threatened.",
    "If Attacked": "Seek immediate medical attention as bites can cause bacterial infections.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Throughout the island, including urban areas.",
    "Venom Type": "None",
    "Description": "The Indian Flying Fox ( *Pteropus giganteus*) is a large fruit bat with a wingspan reaching up to 1.5 meters. They are primarily nocturnal and roost in large colonies in trees, often in urban environments.  Their diet consists mainly of fruits, nectar, and flowers, playing a crucial role in seed dispersal and pollination across Sri Lanka.  While generally docile, they possess sharp teeth for consuming fruit and can inflict a painful bite if handled or threatened. They are vital for maintaining the health of Sri Lankan ecosystems."
  },
  {
    "Common Name": "Lesser Yellow-lipped Bat",
    "Scientific Name": "Scotophilus heathi",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May squeak or try to bite if handled, but generally avoids confrontation.",
    "If Attacked": "Wash any bite thoroughly with soap and water.  Consult a doctor if necessary.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Throughout the island, including dry lowlands, intermediate zones, and even some areas in the wet zone.",
    "Venom Type": "None",
    "Description": "The Lesser Yellow-lipped Bat ( *Scotophilus heathi*) is a medium-sized microbat endemic to Sri Lanka.  It is distinguished by its yellow lips, giving it its common name. This bat is insectivorous, playing a vital role in controlling insect populations in various habitats across the island. It roosts in trees, buildings, and other man-made structures, often in small colonies. They are typically active at night, emerging to forage for insects in flight. While they are widespread in Sri Lanka, their population status is not fully known and further research is needed to assess any potential threats."
  },
  {
    "Common Name": "Jackal",
    "Scientific Name": "Canis aureus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "Becomes vocal, bares teeth, may lunge or snap.",
    "If Attacked": "Shout loudly, make yourself appear large, do not run, fight back aggressively if necessary.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Throughout the island, except for the highest altitudes.",
    "Venom Type": "None",
    "Description": "The Sri Lankan jackal (Canis aureus naja), a subspecies of the golden jackal, is a medium-sized canid with a golden-brown coat, a bushy tail, and a pointed muzzle. They are highly adaptable and opportunistic omnivores, inhabiting a variety of habitats from dry scrublands and forests to coastal areas and even urban fringes. Their diet includes fruits, insects, small mammals, birds, reptiles, and carrion, playing an important role as scavengers and helping control rodent populations.  They are typically nocturnal and live in small family groups, communicating through howls and other vocalizations."
  },
  {
    "Common Name": "Fishing Cat",
    "Scientific Name": "Prionailurus viverrinus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "Hisses, growls, spits, and arches its back. May flatten its ears and lash its tail.",
    "If Attacked": "Back away slowly and avoid direct eye contact. Make yourself appear large and shout loudly. Do not run.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "All regions, but particularly wetlands and coastal areas.",
    "Venom Type": "None",
    "Description": "The fishing cat (Prionailurus viverrinus) is a medium-sized wild cat adapted to a semi-aquatic lifestyle. It has a stocky build, short legs, a short, thick tail, and webbed paws to aid in swimming and fishing. Its coat is olive-grey with dark spots arranged in longitudinal stripes, providing camouflage in its wetland habitat.  Fishing cats primarily inhabit wetlands, marshes, mangroves, rivers, and streams throughout Sri Lanka. They are nocturnal hunters, feeding primarily on fish, but also consuming frogs, crustaceans, snakes, birds, and small mammals. As an apex predator in its habitat, the fishing cat plays a crucial role in regulating prey populations and maintaining a balanced ecosystem.  They are threatened by habitat loss and human-wildlife conflict."
  },
  {
    "Common Name": "Jungle Cat",
    "Scientific Name": "Felis chaus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Hisses, growls, arches its back, and may swat with claws.",
    "If Attacked": "Make yourself look large, shout, and slowly back away. Do not run.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Throughout the island, including dry zone forests, scrublands, and wetlands.",
    "Venom Type": "None",
    "Description": "The Jungle Cat (Felis chaus), a medium-sized feline, is characterized by its long legs, short tail, and reddish-brown or sandy-grey fur. Its pointed ears often have small black tufts at the tips. Found in various habitats across Sri Lanka, from dry forests and scrublands to wetlands and coastal areas, it is a skilled hunter, preying on rodents, birds, reptiles, and fish. As a predator, the Jungle Cat plays a crucial role in controlling prey populations and maintaining the balance of the ecosystem. While generally shy and elusive, it can display aggression if threatened or cornered."
  },
  {
    "Common Name": "Indian Hare",
    "Scientific Name": "Lepus nigricollis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May flee rapidly or if cornered, may bite and scratch with powerful hind legs.",
    "If Attacked": "Avoid cornering. If bitten, wash the wound thoroughly and seek medical advice if necessary due to infection risk.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Throughout the island, except for dense forests at higher elevations.",
    "Venom Type": "None",
    "Description": "The Indian hare (Lepus nigricollis) is a medium-sized mammal with a distinctive black nape band from which its scientific name derives. They have long ears, powerful hind legs for running, and a yellowish-brown coat that provides camouflage in their preferred habitats of open grasslands, scrublands, and agricultural areas.  These herbivores play an essential role in the ecosystem as prey for predators like leopards and jackals, and contribute to seed dispersal. They are generally nocturnal but can be active during cooler parts of the day."
  },
  {
    "Common Name": "Indian Giant Squirrel",
    "Scientific Name": "Ratufa indica",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May chatter loudly, flick its tail, and display aggressive postures.",
    "If Attacked": "Give it space and allow it to retreat.  Bites are rare but possible if cornered.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Dry zone and intermediate zones, including areas like Uva, North Central, and parts of Eastern provinces.",
    "Venom Type": "None",
    "Description": "The Indian giant squirrel ( *Ratufa indica* ) is a large, diurnal, arboreal rodent known for its striking two-toned fur, often with shades of maroon, rust, and beige. They possess a long, bushy tail which aids in balance as they navigate the canopy.  Primarily herbivorous, their diet consists of fruits, nuts, flowers, and bark. They play a vital role in seed dispersal within their forest habitats, contributing to the regeneration of the ecosystem.  While not endemic to Sri Lanka, they are a conspicuous and important part of the island's diverse fauna."
  },
  {
    "Common Name": "Layard's Palm Squirrel",
    "Scientific Name": "Funambulus layardi",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May chatter loudly, flick its tail rapidly, and attempt to bite if cornered.",
    "If Attacked": "Wash any bite wound thoroughly with soap and water. Seek medical advice if the wound is deep or shows signs of infection.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Central, including Knuckles Mountain Range and surrounding areas.",
    "Venom Type": "None",
    "Description": "Layard's Palm Squirrel ( *Funambulus layardi* ) is a medium-sized, diurnal tree squirrel endemic to the central highlands of Sri Lanka.  It is characterized by its grizzled, olive-brown fur, a dark stripe running down its back, and a bushy, greyish-white tail. This squirrel inhabits montane and submontane forests, predominantly feeding on fruits, nuts, seeds, and insects found in the canopy.  It plays a vital role in seed dispersal within its ecosystem. While generally shy and retiring,  Layard's Palm Squirrels can be quite vocal, communicating with a variety of calls."
  },
  {
    "Common Name": "Flame-striped Jungle Squirrel",
    "Scientific Name": "Funambulus sublineatus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May chatter loudly and flick its tail.  Could attempt to bite if cornered.",
    "If Attacked": "Leave the animal alone and allow it to escape. Wash any bite wound thoroughly.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Throughout the island, but mainly in lowland rainforests and adjacent areas.",
    "Venom Type": "None",
    "Description": "The Flame-striped Jungle Squirrel ( *Funambulus sublineatus* ) is a small, diurnal rodent with distinctive chestnut-red stripes running down its back against a generally olive-brown or greyish fur. Its underside is typically creamy-white. This squirrel prefers dense foliage and can often be found foraging for fruits, nuts, seeds, insects, and flowers in the undergrowth and lower canopy of Sri Lanka's rainforests.  It plays a vital role in seed dispersal, contributing to the regeneration of forest ecosystems. Although generally shy, they can become habituated to human presence in some areas."
  },
  {
    "Common Name": "Dusky Striped Squirrel",
    "Scientific Name": "Funambulus obscurus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May chatter loudly, flick its tail rapidly, and attempt to bite if cornered.",
    "If Attacked": "Leave the animal alone and allow it to escape. Wash any bite wound thoroughly with soap and water.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Wet zone lowlands and some parts of the intermediate zone.",
    "Venom Type": "None",
    "Description": "The Dusky Striped Squirrel ( *Funambulus obscurus* ) is a small, diurnal rodent characterized by three dark stripes running down its back against a generally olive-brown or grayish fur.  Its underside is a lighter buff or orange color.  Inhabiting the wet zone lowland and some parts of the intermediate zone forests of Sri Lanka, this agile squirrel prefers the canopy but also forages on the ground.  Its diet primarily consists of fruits, nuts, seeds, flowers, and insects, playing a role in seed dispersal and forest regeneration.  While generally shy and avoiding human interaction, they can become defensive if threatened or cornered."
  },
  {
    "Common Name": "House Mouse",
    "Scientific Name": "Mus musculus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May bite if cornered or threatened. Typically tries to flee.",
    "If Attacked": "Wash the bite area thoroughly with soap and water. Seek medical advice if necessary (due to risk of infection).",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Island-wide",
    "Venom Type": "None",
    "Description": "The house mouse (Mus musculus) is a small rodent with a light brown to greyish body, large ears, and a long, thin tail.  It is a highly adaptable species found throughout Sri Lanka, inhabiting a wide range of environments from urban areas and agricultural lands to forests.  Primarily nocturnal, it constructs nests in hidden spaces and is an omnivore, feeding on grains, seeds, insects, and human food scraps.  House mice play a role in the ecosystem as both prey for larger animals and seed dispersers, though they are also considered pests due to their impact on stored food and their potential to spread diseases."
  },
  {
    "Common Name": "Roof Rat",
    "Scientific Name": "Rattus rattus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May bite if cornered or threatened. Typically tries to flee.",
    "If Attacked": "Wash the bite thoroughly with soap and water and seek medical advice if necessary due to the risk of infection.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Island-wide",
    "Venom Type": "None",
    "Description": "The Roof Rat ( *Rattus rattus*) is a medium-sized rodent with a slender body, large ears, and a pointed snout.  Its fur is typically dark brown or black, though variations exist.  Found throughout Sri Lanka in both urban and rural environments,  it is a highly adaptable species that thrives in human settlements, agricultural lands, and forests. Roof rats are primarily nocturnal and excellent climbers, often nesting in attics, roofs, and trees.  They are omnivorous, feeding on a wide variety of fruits, seeds, grains, insects, and even small vertebrates. While playing a role in seed dispersal, they are also considered a pest due to their tendency to consume stored food and damage property, as well as being a potential vector for diseases."
  },
  {
    "Common Name": "Indian Pipistrelle",
    "Scientific Name": "Pipistrellus coromandra",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May emit high-pitched squeaks and attempt to bite if cornered or handled.",
    "If Attacked": "Wash any bite thoroughly with soap and water and seek medical advice as bats can carry rabies.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Throughout the island",
    "Venom Type": "None",
    "Description": "The Indian Pipistrelle ( *Pipistrellus coromandra*) is a small microbat found widely across South and Southeast Asia, including Sri Lanka.  These bats are characterized by their short, dark brown fur and reddish-brown wing membranes. They are insectivorous, playing a vital role in controlling insect populations. They roost in a variety of locations, including tree hollows, rock crevices, and buildings. They are nocturnal, emerging at dusk to forage for insects in a variety of habitats, from forests and urban areas to agricultural lands.  While generally harmless, like any wild animal they should be treated with caution."
  },
  {
    "Common Name": "Common Shrew",
    "Scientific Name": "Suncus murinus",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May emit high-pitched squeaks and attempt to bite.",
    "If Attacked": "Wash the bite thoroughly with soap and water and seek medical advice if symptoms develop.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Island-wide",
    "Venom Type": "Mild, toxic saliva with some anticoagulant properties.",
    "Description": "The Common Shrew ( *Suncus murinus*) is a small, mouse-like mammal with a pointed snout, velvety fur, and small eyes.  It is typically grayish-brown in color.  Found throughout Sri Lanka in a variety of habitats, including gardens, forests, and urban areas, it is a highly adaptable species.  Primarily nocturnal, it plays an essential role in the ecosystem by controlling insect populations, consuming invertebrates, and occasionally small vertebrates. Though its saliva contains toxins used to subdue prey, it poses little threat to humans, and bites rarely cause more than localized pain and swelling."
  },
  {
    "Common Name": "Otter",
    "Scientific Name": "Lutra lutra",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May hiss, growl, and attempt to bite if cornered or feeling threatened.  Generally avoids confrontation.",
    "If Attacked": "Back away slowly and avoid further provoking the animal. Seek medical attention if bitten, as any wild animal bite carries risk of infection.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Throughout the island, including rivers, wetlands, coastal areas, and even some urban canals.",
    "Venom Type": "None",
    "Description": "The Eurasian otter ( *Lutra lutra*) is a sleek, semi-aquatic mammal with a long, muscular body, short legs, webbed feet, and a thick, brown fur coat providing excellent insulation.  They are highly adaptable, found in a variety of freshwater habitats across Sri Lanka, from rivers and streams to marshes and coastal lagoons.  Primarily nocturnal, they are skilled fishers, consuming fish, crustaceans, frogs, and small mammals. As apex predators in their freshwater ecosystems, otters play a vital role in regulating prey populations and maintaining the health of these environments. Although widespread globally, their presence in Sri Lanka highlights the island's rich biodiversity."
  },
  {
    "Common Name": "Dugong",
    "Scientific Name": "Dugong dugon",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May become defensive if harassed, particularly mothers protecting calves.  Could attempt to flee or use their powerful tails defensively.",
    "If Attacked": "Move away calmly and quickly. Do not approach or corner the animal.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "North Western, Northern, Eastern, Southern coastal waters",
    "Venom Type": "None",
    "Description": "The dugong ( *Dugong dugon*) is a large, gentle marine mammal inhabiting warm coastal waters, including those around Sri Lanka. They are characterized by their large, cylindrical bodies, paddle-like flippers, and fluked tails similar to whales. Dugongs graze primarily on seagrass beds in shallow waters, playing a vital role in maintaining these ecosystems' health.  They are known as \"sea cows\" due to their herbivorous diet and slow, deliberate movements.  While generally docile, they can be protective of their young.  Dugongs face threats from habitat loss, fishing net entanglement, and boat strikes."
  },
  {
    "Common Name": "Spinner Dolphin",
    "Scientific Name": "Stenella longirostris",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May exhibit erratic swimming patterns, rapid changes in direction, and splashing.",
    "If Attacked": "Extremely unlikely. Move away slowly and calmly.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Coastal waters around Sri Lanka",
    "Venom Type": "None",
    "Description": "The spinner dolphin ( *Stenella longirostris*) is a small, slender dolphin known for its acrobatic aerial displays, including spinning leaps out of the water.  They are found in tropical and subtropical oceans worldwide, including the coastal waters of Sri Lanka.  Spinner dolphins are highly social animals, often forming large pods. They primarily feed on small fish and squid, hunting at night in deeper waters and resting closer to shore during the day.  Their presence plays a vital role in maintaining the balance of the marine ecosystem."
  },
  {
    "Common Name": "Blue Whale",
    "Scientific Name": "Balaenoptera musculus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May exhibit increased speed, erratic movements, or vocalizations.",
    "If Attacked": "Extremely unlikely. Maintain a respectful distance and move away slowly.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Southern, Western, Eastern (migratory; waters surrounding Sri Lanka)",
    "Venom Type": "None",
    "Description": "The blue whale (Balaenoptera musculus) is the largest animal on Earth, reaching lengths of up to 100 feet. These magnificent marine mammals are characterized by their long, streamlined bodies, bluish-grey coloration, and small dorsal fin. They are baleen whales, filtering massive quantities of krill and small fish from the ocean using baleen plates in their mouths. Blue whales are migratory, traversing vast distances across the world's oceans.  In Sri Lankan waters, they are typically observed during their migrations in the deeper waters surrounding the island, particularly off the southern, western, and eastern coasts.  They play a vital role in the marine ecosystem by regulating prey populations and contributing to nutrient cycling."
  },
  {
    "Common Name": "Sperm Whale",
    "Scientific Name": "Physeter macrocephalus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low (unless provoked)",
    "Behavior (Agitated)": "May become aggressive if threatened, using its tail to slap the surface or its head to ram objects.",
    "If Attacked": "Move away quickly and put as much distance as possible between yourself and the whale.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Deep waters surrounding Sri Lanka, particularly off the southern and western coasts.",
    "Venom Type": "None",
    "Description": "The Sperm Whale ( *Physeter macrocephalus* ) is the largest toothed predator on Earth, characterized by its massive, square-shaped head.  Males can reach lengths of up to 20 meters.  They dive deep into the ocean, often to depths exceeding 1,000 meters, to hunt squid and other deep-sea creatures. Sperm whales play a significant role in the marine ecosystem by regulating prey populations and nutrient cycling.  While generally docile, they can become defensive if they perceive a threat, especially to their young.  Sri Lanka's waters are an important feeding and breeding ground for these magnificent creatures."
  },
  {
    "Common Name": "Estuarine Crocodile",
    "Scientific Name": "Crocodylus porosus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Becomes highly aggressive, hissing loudly, inflating its body, and thrashing its tail. May perform open-mouthed displays and lunge forward.",
    "If Attacked": "Run away as fast as possible in a straight line.  Do not attempt to fight back unless absolutely necessary. If escape is impossible, aim for the eyes and snout.",
    "Category": "Reptile (Crocodilian)",
    "Endemic": "No",
    "Region": "Widely distributed in coastal lagoons, estuaries, rivers, and sometimes even the open sea, especially around the North, North Western, and Eastern coastal regions.",
    "Venom Type": "None",
    "Description": "The Saltwater Crocodile ( *Crocodylus porosus*) is the largest living reptile and a formidable apex predator.  In Sri Lanka, these powerful creatures inhabit a variety of aquatic habitats, from brackish estuaries and mangrove swamps to freshwater rivers.  They are ambush predators, feeding on fish, birds, mammals, and other reptiles.  Their role as apex predators is vital for maintaining the balance of the ecosystem, regulating prey populations, and influencing the structure of the wetland communities they inhabit.  Saltwater crocodiles have a broad snout and powerful jaws, equipped with sharp teeth designed for gripping and tearing flesh. They are known for their exceptional swimming ability and can tolerate both freshwater and saltwater environments."
  },
  {
    "Common Name": "Mugger Crocodile",
    "Scientific Name": "Crocodylus palustris",
    "Poison Level": "Non-Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Becomes highly aggressive, hissing loudly, inflating its body, and lashing its tail. May lunge or charge towards the perceived threat.",
    "If Attacked": "Try to escape the area immediately. If unable to escape, target the eyes and nose to deter the attack.",
    "Category": "Amphibian",
    "Endemic": "No",
    "Region": "Throughout the island, particularly in and around rivers, lakes, marshes, and coastal lagoons.",
    "Venom Type": "None",
    "Description": "The Mugger Crocodile ( *Crocodylus palustris*) is a large, powerful reptile with a broad snout and thick, heavily armored skin. They are ambush predators, often lurking submerged in water with only their eyes and nostrils exposed, waiting for unsuspecting prey. Their diet consists mainly of fish, birds, mammals, and other reptiles.  As apex predators, Mugger Crocodiles play a crucial role in regulating the populations of their prey species and maintaining the balance of the wetland ecosystems they inhabit. While they are generally shy and avoid human interaction, they can be highly aggressive when threatened or protecting their young."
  },
  {
    "Common Name": "Indian Rock Python",
    "Scientific Name": "Python molurus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "When threatened, it coils tightly, hisses loudly, and may strike.",
    "If Attacked": "Back away slowly and do not attempt to handle it. Seek medical attention if bitten, as large pythons can inflict serious wounds.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "Throughout the island, but more common in dry lowlands and coastal regions.",
    "Venom Type": "None",
    "Description": "The Indian Rock Python ( *Python molurus*) is a large non-venomous constrictor.  It can reach lengths exceeding 6 meters, with a heavy body covered in patterned scales ranging from brown to yellowish.  They inhabit diverse habitats, including forests, scrublands, and rocky areas near water sources.  As an apex predator, it plays a vital role in regulating prey populations, primarily consisting of rodents, birds, and other mammals.  Although generally shy and retiring, they can be dangerous if provoked or cornered, using their powerful muscles to constrict and suffocate their prey."
  },
  {
    "Common Name": "Cobra   Spectacled Cobra",
    "Scientific Name": "Naja naja",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Raises hood, hisses loudly, and may strike repeatedly.",
    "If Attacked": "Seek immediate medical attention. Antivenom is crucial.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "Throughout the island, except at the highest altitudes.",
    "Venom Type": "Primarily Neurotoxic",
    "Description": "The Spectacled Cobra (Naja naja) is a large, venomous snake easily identified by the spectacle marking on its hood.  This marking, which resembles eyeglasses, can vary in shape and size depending on the individual.  They are found in a variety of habitats in Sri Lanka from forests and plains to agricultural areas and even near human settlements.  Cobras are primarily nocturnal hunters, feeding on rodents, frogs, lizards, and other snakes, playing a crucial role in controlling rodent populations. They are also known to be opportunistic feeders and occasionally consume birds and eggs. Their neurotoxic venom affects the nervous system, causing paralysis and respiratory failure."
  },
  {
    "Common Name": "Russell's Viper",
    "Scientific Name": "Daboia russelii",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Coils tightly, hisses loudly, and strikes readily with a characteristic \"sizzling\" warning sound.",
    "If Attacked": "Seek immediate medical attention.  Immobilize the affected limb and remain calm to slow venom spread. Traditional first aid methods are ineffective and potentially harmful.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "Throughout the island, except at higher elevations.  Most common in the dry zone and lowlands.",
    "Venom Type": "Hemotoxic",
    "Description": "Russell's viper is a heavy-bodied, stout snake with a triangular head distinct from its neck.  Its coloration varies from yellowish-brown to brownish-grey, overlaid with three rows of dark brown or black oval-shaped blotches bordered with white or yellow. These markings provide excellent camouflage amongst leaf litter and dry vegetation in its preferred habitats, which include grasslands, scrublands, and agricultural areas.  A primarily nocturnal ambush predator, it feeds on rodents, lizards, and other small mammals, playing a crucial role in controlling rodent populations.  Its potent hemotoxic venom causes severe pain, swelling, and tissue damage, potentially leading to complications such as kidney failure and disseminated intravascular coagulation (DIC)."
  },
  {
    "Common Name": "Saw-scaled Viper",
    "Scientific Name": "Echis carinatus",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Coils tightly, rubs its keeled scales together to produce a loud hissing warning sound.  May strike repeatedly.",
    "If Attacked": "Seek immediate medical attention. Immobilize the affected limb and stay calm to slow venom spread.  Traditional first aid methods are not effective.",
    "Category": "Snake",
    "Endemic": "Yes",
    "Region": "Dry zone, including North Western, Northern, Eastern, and parts of North Central provinces.",
    "Venom Type": "Hemotoxic",
    "Description": "The Saw-scaled Viper ( *Echis carinatus*) is a small but highly venomous viper identifiable by its sandy or light brown coloration, often with darker, chevron-shaped markings.  It prefers arid and semi-arid habitats such as scrublands, rocky outcrops, and coastal regions.  This viper is nocturnal and hunts small rodents, lizards, and other invertebrates, playing a vital role in controlling prey populations within its ecosystem.  Its scales have a distinctly keeled texture, giving it a rough feel.  The saw-scaled viper is responsible for a significant number of snakebite fatalities in Sri Lanka due to its potent hemotoxic venom which causes severe internal bleeding and tissue damage."
  },
  {
    "Common Name": "Common Krait",
    "Scientific Name": "Bungarus caeruleus",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "When threatened, the Common Krait typically coils tightly, hides its head, and may whip its tail as a warning. Bites often occur when accidentally stepped on or handled.  They are primarily nocturnal and generally shy.",
    "If Attacked": "Seek immediate medical attention.  Traditional first aid methods are largely ineffective against krait venom. Antivenom is crucial for survival.",
    "Category": "Snake",
    "Endemic": "Yes",
    "Region": "Throughout the island, except at higher elevations.",
    "Venom Type": "Neurotoxic",
    "Description": "The Common Krait ( *Bungarus caeruleus*) is a highly venomous elapid snake found throughout Sri Lanka, excluding the highest altitudes. It is a sleek, nocturnal snake with smooth, glossy scales, generally bluish-black to black in color with thin white crossbands. Kraits inhabit a variety of habitats, including forests, scrublands, agricultural fields, and even human settlements.  They are primarily rodent hunters, playing an important role in controlling rodent populations, but also consume other snakes, lizards, and frogs.  Their potent neurotoxic venom acts primarily on the nervous system, causing paralysis and respiratory failure. Bites are often painless, making them especially dangerous.  They are a significant contributor to snakebite fatalities in Sri Lanka."
  },
  {
    "Common Name": "Common Bronzeback Tree Snake",
    "Scientific Name": "Dendrelaphis tristis",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May inflate its neck, try to bite, and release a foul-smelling musk.",
    "If Attacked": "Wash the bite thoroughly with soap and water and seek medical attention if symptoms develop.",
    "Category": "Snake",
    "Endemic": "Yes",
    "Region": "Throughout the island, including dry lowlands, forests, and even urban areas.",
    "Venom Type": "Mild",
    "Description": "The Common Bronzeback Tree Snake ( *Dendrelaphis tristis*) is a slender, diurnal colubrid snake with smooth scales, typically olive-brown or bronze in color, with a lighter underside.  A distinct black stripe runs from behind the eye to the corner of the mouth.  They are highly arboreal, inhabiting a variety of habitats across Sri Lanka, including forests, scrublands, and home gardens. Primarily feeding on lizards and frogs, they play a crucial role in regulating prey populations within their ecosystem. Their venom is mild and poses little threat to humans, though individual reactions can vary.  They are generally non-aggressive but will bite if threatened or cornered."
  },
  {
    "Common Name": "Green Vine Snake",
    "Scientific Name": "Ahaetulla nasuta",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Inflates neck region, may strike defensively but rarely bites.",
    "If Attacked": "Wash the bite area thoroughly with soap and water. Seek medical attention if any symptoms develop.",
    "Category": "Snake",
    "Endemic": "Yes",
    "Region": "Throughout the island, particularly in lowlands and forested areas.",
    "Venom Type": "Mild, primarily Hemotoxic",
    "Description": "The Green Vine Snake ( *Ahaetulla nasuta*) is a slender, bright green arboreal snake perfectly camouflaged amongst foliage.  Its horizontal pupils and pointed snout are distinctive features.  Found in a variety of habitats from forests to home gardens, it primarily feeds on lizards and frogs, ambushing them with incredible speed. Though mildly venomous, its venom poses little threat to humans and is primarily used to subdue its prey.  This diurnal snake plays a crucial role in controlling lizard and frog populations within its ecosystem."
  },
  {
    "Common Name": "Rat Snake",
    "Scientific Name": "Ptyas mucosa",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "When threatened, it rears up, flattens its neck slightly (not as dramatically as a cobra), hisses loudly, and may strike.",
    "If Attacked": "Move away slowly and allow the snake to escape.  Wash any bite thoroughly with soap and water and seek medical attention, though serious effects are rare.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "Island-wide, including all provinces.",
    "Venom Type": "Mild",
    "Description": "The rat snake ( *Ptyas mucosa*) is a large, non-venomous (rear-fanged, mildly venomous) colubrid snake found throughout Sri Lanka in diverse habitats, from forests and grasslands to urban areas. They are diurnal and primarily feed on rodents, lizards, frogs, and birds, playing a crucial role in controlling rodent populations.  These slender, agile snakes are typically olive-brown to yellowish in color, with smooth scales and prominent eyes.  They are excellent climbers and swimmers, often found near water sources. While their bite can cause localized pain and swelling due to their mildly venomous saliva, it poses little threat to humans. They are often confused with cobras due to their defensive posture, but they lack the distinctive hood."
  },
  {
    "Common Name": "Buff-striped Keelback",
    "Scientific Name": "Amphiesma stolatum",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May flatten its head and neck, hiss, and strike defensively.",
    "If Attacked": "Wash the bite area thoroughly with soap and water. Seek medical attention if symptoms develop.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "Throughout the island, except for higher elevations.",
    "Venom Type": "Mild, primarily affecting prey.",
    "Description": "The Buff-striped Keelback ( *Amphiesma stolatum* ) is a slender, non-aggressive snake with distinct buff-colored stripes running along its body. It is commonly found in a variety of habitats across Sri Lanka, including grasslands, forests, and wetlands, often near water sources. This diurnal snake primarily feeds on frogs, tadpoles, and small fish, playing a role in controlling their populations. While mildly venomous, its venom poses little threat to humans and is mainly used to subdue its prey.  The Buff-striped Keelback is a relatively common and adaptable species, contributing to the biodiversity of Sri Lanka's ecosystems."
  },
  {
    "Common Name": "Common Garden Lizard   Oriental Garden Lizard",
    "Scientific Name": "Calotes versicolor",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May inflate throat pouch, display bright colors (especially males), bob head, and try to bite if cornered.",
    "If Attacked": "Wash the bite with soap and water. Seek medical attention if any signs of infection develop.",
    "Category": "Reptile (Lizard specifically)",
    "Endemic": "No",
    "Region": "Throughout the island, including urban areas.",
    "Venom Type": "None",
    "Description": "The Oriental Garden Lizard ( *Calotes versicolor*) is a common agamid lizard found across Sri Lanka.  These diurnal reptiles are typically green or brown, with males displaying vibrant colors, particularly during breeding season. Their coloration helps them camouflage in their arboreal habitat, which includes trees, shrubs, and even human dwellings. They play a vital role in the ecosystem by controlling insect populations, consuming a diet primarily of crickets, grasshoppers, and other invertebrates. They are in turn preyed upon by snakes, birds, and larger reptiles.  While their bite can be painful, they are non-venomous and pose little threat to humans."
  },
  {
    "Common Name": "Green Garden Lizard",
    "Scientific Name": "Calotes calotes",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Inflates its gular pouch, bobs its head, and may try to bite if cornered.",
    "If Attacked": "Wash the bite area thoroughly with soap and water. Seek medical advice if any signs of infection appear.",
    "Category": "Reptile (Lizard specifically - though this wasn't an option provided)",
    "Endemic": "No",
    "Region": "Throughout the island, including urban areas, gardens, and forests.",
    "Venom Type": "None",
    "Description": "The Green Garden Lizard ( *Calotes calotes*) is a common agamid lizard found across Sri Lanka.  These diurnal reptiles are typically bright green, though they can change color to shades of brown and yellow, particularly males during breeding season. They possess a prominent spiny crest along their back and a large, inflatable gular pouch.  Green Garden Lizards are primarily insectivores, playing a valuable role in controlling insect populations. They are often seen basking in the sun and are agile climbers, preferring trees, shrubs, and walls as their habitat."
  },
  {
    "Common Name": "Star Tortoise",
    "Scientific Name": "Geochelone elegans",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Withdraws into its shell. May hiss.",
    "If Attacked": "Leave it alone; it poses no threat.",
    "Category": "Reptile (technically a Testudine, a sub-order of reptiles)",
    "Endemic": "No (also found in India and Pakistan)",
    "Region": "Dry Zone (specifically, North Western, Northern, and parts of Eastern provinces).",
    "Venom Type": "None",
    "Description": "The Star Tortoise ( *Geochelone elegans*) is a medium-sized tortoise identified by its striking star-shaped pattern on its high-domed carapace.  These beautiful markings unfortunately make them a target in the illegal pet trade. They inhabit dry scrubland and arid grasslands in Sri Lanka, India, and Pakistan, where they graze on grasses, succulents, and fallen fruits.  As herbivores, they play a role in seed dispersal and contribute to the health of their ecosystem.  They are a threatened species due to habitat loss and illegal collection."
  },
  {
    "Common Name": "Indian Black Turtle",
    "Scientific Name": "Melanochelys trijuga",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May withdraw into its shell, hiss, or attempt to bite.",
    "If Attacked": "Leave it alone; if bitten, wash the wound thoroughly.",
    "Category": "Amphibian",
    "Endemic": "No",
    "Region": "Throughout the island, especially in low-lying areas, tanks, and reservoirs.",
    "Venom Type": "None",
    "Description": "The Indian Black Turtle (Melanochelys trijuga) is a medium-sized freshwater turtle with a dark brown to black carapace (upper shell) and a yellowish plastron (lower shell).  It inhabits a variety of aquatic environments, including rivers, marshes, and rice paddies across Sri Lanka.  As an omnivore, it feeds on aquatic plants, insects, mollusks, and carrion, playing a vital role in nutrient cycling and controlling invertebrate populations.  While generally docile, they can become defensive if threatened. The Indian Black Turtle is not endemic to Sri Lanka and has a wider distribution across South Asia."
  },
  {
    "Common Name": "Common Monitor Lizard",
    "Scientific Name": "Varanus bengalensis",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Hisses, inflates body, whips tail, may bite.",
    "If Attacked": "Move away slowly; if bitten, wash the wound thoroughly and seek medical attention due to risk of bacterial infection.",
    "Category": "Reptile (While not listed, this is the correct category, as lizards are reptiles)",
    "Endemic": "No",
    "Region": "Throughout the island, including dry zone, forested areas, and urban environments.",
    "Venom Type": "Mild, primarily for prey incapacitation; effects on humans are mainly localized pain and swelling.",
    "Description": "The Common Monitor Lizard ( *Varanus bengalensis*) is a large reptile found throughout Sri Lanka, inhabiting diverse environments from dry scrublands and forests to urban areas.  They are robust lizards with powerful limbs, sharp claws, and a long, muscular tail used for defense and balance.  Their coloration varies from grayish-brown to black, often with faint bands or spots. These opportunistic carnivores play a vital role in the ecosystem as scavengers and predators, consuming insects, rodents, reptiles, birds, and carrion, helping control pest populations and recycle nutrients. While generally shy and avoidant of humans, they can become defensive if cornered or provoked."
  },
  {
    "Common Name": "Water Monitor",
    "Scientific Name": "Varanus salvator",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "Hisses, inflates its body, whips its tail, and may bite.",
    "If Attacked": "Move away slowly and seek medical attention if bitten.  Clean the wound thoroughly with antiseptic soap and water.",
    "Category": "Reptile (While not listed, this is the appropriate category)",
    "Endemic": "Yes",
    "Region": "Throughout the island, including urban areas, but prefers areas close to water.",
    "Venom Type": "Mild, primarily for assisting with prey digestion, though bites can cause bacterial infections.",
    "Description": "The Water Monitor (Varanus salvator) is a large lizard, often exceeding 6 feet in length, characterized by its robust build, dark gray or black body with yellow spots and bands, and a powerful, long tail. It thrives in a variety of habitats across Sri Lanka, from wetlands and mangroves to forests and even urban areas, always in proximity to water sources.  A skilled swimmer and climber, it plays a crucial role in the ecosystem as an apex predator, consuming carrion, rodents, birds, fish, crabs, and other reptiles, helping to control their populations.  Though not typically aggressive, they can deliver a painful bite if cornered or threatened."
  },
  {
    "Common Name": "Common Skink",
    "Scientific Name": "Mabuya carinata",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May try to bite, but its bite is harmless to humans.  Will likely try to escape.",
    "If Attacked": "No specific action needed. Gently remove if necessary.",
    "Category": "Reptile (specifically, a lizard, but since that option isn't available, none of the available categories are correct.)",
    "Endemic": "No",
    "Region": "Throughout the island, including urban areas.",
    "Venom Type": "None",
    "Description": "The Common Skink ( *Mabuya carinata* ) is a small, slender lizard with smooth, shiny scales, often bronze or brown in color with variable stripes or markings. It is commonly found in gardens, urban areas, and a variety of habitats across Sri Lanka, often seen basking in the sun.  These skinks play a vital role in the ecosystem by controlling insect populations, consuming small invertebrates like ants, spiders, and termites. They are in turn preyed upon by larger reptiles, birds, and mammals.  They are generally shy and quick to disappear into crevices or undergrowth when disturbed."
  },
  {
    "Common Name": "House Gecko",
    "Scientific Name": "Hemidactylus frenatus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May bite if cornered, but the bite is harmless.  Likely to vocalize with chirping sounds and attempt to escape.",
    "If Attacked": "Gently brush the gecko away or allow it to escape on its own.  Wash the area of a bite with soap and water.",
    "Category": "Reptile",
    "Endemic": "No",
    "Region": "Island-wide",
    "Venom Type": "None",
    "Description": "The House Gecko ( *Hemidactylus frenatus* ) is a small, nocturnal reptile commonly found in homes and buildings across Sri Lanka.  They are characterized by their soft, granular skin, adhesive toe pads allowing them to climb vertical surfaces, and large eyes with vertical pupils. Primarily insectivorous, they play a beneficial role in controlling insect populations, including mosquitoes and flies.  House geckos are highly adaptable and thrive in human-modified environments, utilizing cracks, crevices, and wall spaces for shelter.  Their distinctive chirping calls are a familiar night-time sound in Sri Lanka."
  },
  {
    "Common Name": "Fan-throated Lizard",
    "Scientific Name": "Sitana ponticeriana",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Displays its vibrant throat fan, performs push-ups, and may try to bite if cornered.",
    "If Attacked": "Move away slowly.  Their bite is harmless to humans.",
    "Category": "Amphibian",
    "Endemic": "Yes",
    "Region": "Dry and intermediate zones throughout the country, including North Western, Northern, Eastern, and parts of Southern and Central provinces.",
    "Venom Type": "None",
    "Description": "The Fan-throated Lizard ( *Sitana ponticeriana*) is a small, diurnal lizard known for the male's striking, brightly colored dewlap or throat fan, which it extends during courtship and territorial displays. This fan is typically bright orange, yellow, or red with blue markings. These lizards inhabit dry, open areas with scrub vegetation, and are often found basking on rocks and open ground. They are insectivores, playing a role in controlling insect populations.  The female lacks the vibrant dewlap and is more cryptically colored.  Their small size makes them prey for larger reptiles, birds, and mammals, contributing to the food web in their ecosystem."
  },
  {
    "Common Name": "Leatherback Sea Turtle",
    "Scientific Name": "Dermochelys coriacea",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May attempt to bite if threatened or restrained, but generally avoids confrontation.",
    "If Attacked": "Move away slowly and allow the turtle to return to the ocean.",
    "Category": "Reptile (Sea Turtle)",
    "Endemic": "No",
    "Region": "Coastal waters around the entire island.",
    "Venom Type": "None",
    "Description": "The Leatherback Sea Turtle ( *Dermochelys coriacea*) is the largest living turtle, easily recognized by its leathery carapace instead of a hard shell.  They are highly migratory, traversing vast oceans and visiting Sri Lankan waters primarily for breeding and foraging.  Their diet mainly consists of jellyfish, playing a crucial role in controlling jellyfish populations.  Leatherbacks face numerous threats including entanglement in fishing gear and habitat destruction, making them a vulnerable species globally.  They nest on sandy beaches, typically at night, where females lay clutches of eggs."
  },
  {
    "Common Name": "Green Sea Turtle",
    "Scientific Name": "Chelonia mydas",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May attempt to bite if feeling threatened, especially on land.  Will generally try to escape into the water.",
    "If Attacked": "Move away slowly. Do not attempt to handle or restrain.",
    "Category": "Reptile",
    "Endemic": "No",
    "Region": "Coastal waters around the entire island.",
    "Venom Type": "None",
    "Description": "The Green Sea Turtle ( *Chelonia mydas* ) is a large marine reptile with a smooth, heart-shaped carapace that ranges in color from olive to brown.  They are found in tropical and subtropical oceans around the world, including the coastal waters of Sri Lanka.  Green turtles are primarily herbivorous, grazing on seagrass and algae, which helps maintain healthy seagrass beds and contributes to the overall health of the marine ecosystem.  They are threatened by habitat loss, fishing bycatch, and pollution, and are considered endangered globally.  Female green turtles return to the beaches where they were born to lay their eggs."
  },
  {
    "Common Name": "Olive Ridley Sea Turtle",
    "Scientific Name": "Lepidochelys olivacea",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May attempt to bite if feeling threatened or cornered on land. Generally avoids confrontation.",
    "If Attacked": "Move away slowly and give the turtle space.  Do not attempt to handle it.",
    "Category": "Reptile (Sea Turtle)",
    "Endemic": "No",
    "Region": "Coastal waters around Sri Lanka",
    "Venom Type": "None",
    "Description": "The Olive Ridley sea turtle (Lepidochelys olivacea) is a medium-sized sea turtle characterized by its olive-colored, heart-shaped carapace. They are primarily found in tropical and subtropical waters, including the coastal regions of Sri Lanka. Olive Ridleys are known for their \"arribada\" nesting behavior, where thousands of females come ashore simultaneously to lay eggs.  They are primarily carnivorous, feeding on jellyfish, crustaceans, mollusks, and fish. As a part of the marine ecosystem, they play a role in controlling prey populations and nutrient cycling.  They face threats from habitat destruction, fishing gear entanglement, and pollution."
  },
  {
    "Common Name": "Sri Lanka Junglefowl",
    "Scientific Name": "Gallus lafayetii",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Males become aggressive, especially during breeding season, displaying upright posture, flapping wings, and loud calls.  Hens can become protective of chicks.",
    "If Attacked": "Slowly back away, avoid direct eye contact, and do not make threatening gestures.",
    "Category": "Bird",
    "Endemic": "Yes",
    "Region": "All regions except the highest altitudes.",
    "Venom Type": "None",
    "Description": "The Sri Lanka Junglefowl ( *Gallus lafayetii*) is a vibrant bird and the national bird of Sri Lanka. Males are a striking mix of orange-red, dark purplish-black, and iridescent green-blue plumage, with a prominent red comb and wattles. Females are more subdued, with mottled brown feathers providing excellent camouflage. They inhabit a variety of habitats, from dense forests to scrublands and even urban areas.  Junglefowl are primarily ground-dwelling birds, foraging for seeds, insects, fruits, and small reptiles.  They play a vital role in seed dispersal and insect control within their ecosystem."
  },
  {
    "Common Name": "Sri Lanka Blue Magpie",
    "Scientific Name": "Urocissa ornata",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Becomes noisy, may swoop or dive at perceived threats, but physical attacks are rare.",
    "If Attacked": "Stay calm and move slowly away.  Attacks are extremely uncommon and unlikely to cause significant harm.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Wet zone forests in the southwest, including the Sinharaja Forest Reserve and the Kitulgala rainforests.",
    "Venom Type": "None",
    "Description": "The Sri Lanka Blue Magpie ( *Urocissa ornata*) is a striking, vibrant bird with bright azure-blue plumage, chestnut-brown head and upper back, and a long, graduated tail tipped with white. This endemic species inhabits the dense canopies of Sri Lanka's southwestern rainforests. It plays a vital role in seed dispersal and insect control within its ecosystem.  The Sri Lanka Blue Magpie is a social bird, often seen in small groups or family units, communicating through a variety of calls, including whistles, chattering, and metallic notes. While generally not aggressive, they can become territorial and protective, especially during breeding season."
  },
  {
    "Common Name": "Sri Lanka Myna",
    "Scientific Name": "Gracula ptilogenys",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May become noisy and flutter wings, attempting to peck if cornered or threatened.",
    "If Attacked": "Slowly back away and avoid direct eye contact.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Southwest wet zone",
    "Venom Type": "None",
    "Description": "The Sri Lanka Myna ( *Gracula ptilogenys* ) is a glossy black bird with distinct yellow wattles and bare yellow skin patches around the eyes.  It is slightly larger than the common myna and has unique curled ear tufts. Found in the southwestern wet zone of Sri Lanka, this myna inhabits forested areas, including rainforests and adjacent cultivated lands.  It is a highly social bird, living in small flocks and plays a role in seed dispersal within its ecosystem, contributing to forest regeneration.  They are known for their ability to mimic sounds, including human speech."
  },
  {
    "Common Name": "Sri Lanka Grey Hornbill",
    "Scientific Name": "Ocyceros gingalensis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May give loud calls and fly away. Could peck if cornered.",
    "If Attacked": "Move away slowly. Avoid cornering the bird.",
    "Category": "Bird",
    "Endemic": "Yes",
    "Region": "Throughout the island, except in higher hills.",
    "Venom Type": "None",
    "Description": "The Sri Lanka Grey Hornbill ( *Ocyceros gingalensis* ) is a medium-sized, endemic bird recognizable by its grey plumage, long curved bill, and casque (a growth on the upper mandible).  They are found in a variety of habitats across Sri Lanka, including forests, woodlands, and cultivated areas, but are absent in higher altitudes. These hornbills primarily feed on fruits, contributing to seed dispersal, but also include insects and small vertebrates in their diet.  They play a crucial role in the ecosystem as both seed dispersers and insect controllers.  They are usually found in pairs or small groups, often making loud, cackling calls while perched in trees."
  },
  {
    "Common Name": "Sri Lanka Wood Pigeon",
    "Scientific Name": "Columba torringtoniae",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May flap wings and coo loudly, attempt to fly away.",
    "If Attacked": "Move away slowly.  There is little chance of attack unless handled.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Throughout the island but primarily wet zone forests in the hills and lower montane regions.",
    "Venom Type": "None",
    "Description": "The Sri Lanka Wood Pigeon ( *Columba torringtoniae* ) is a large, endemic pigeon of Sri Lanka. It is recognizable by its deep purplish-grey plumage, iridescent green neck patch, and distinctive yellow bill with a reddish base.  This pigeon primarily inhabits the wet zone forests, particularly in hilly and lower montane regions.  It plays a vital role in seed dispersal within its forest habitat.  They are generally shy birds, foraging in the canopy for fruits, buds, and leaves."
  },
  {
    "Common Name": "Indian Peafowl",
    "Scientific Name": "Pavo cristatus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May fan out tail feathers, call loudly, and strut aggressively.  Can peck or scratch.",
    "If Attacked": "Slowly back away, avoid eye contact, and make yourself appear large.",
    "Category": "Bird",
    "Endemic": "No (Introduced)",
    "Region": "Throughout the island, especially in drier lowlands and scrublands.",
    "Venom Type": "None",
    "Description": "The Indian Peafowl is a large, colorful bird known for the male's extravagant iridescent blue-green tail feathers, which are displayed during courtship.  Females are brownish and less ornate. They inhabit a range of habitats from dry scrublands to forests and agricultural areas, foraging on the ground for seeds, insects, small reptiles, and fruits. Introduced to Sri Lanka, they are now common and play a role in seed dispersal and insect control, but can also cause crop damage in some areas.  They are often seen near human settlements and are considered sacred in some cultures."
  },
  {
    "Common Name": "Common Mynah",
    "Scientific Name": "Acridotheres tristis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May become noisy and dive-bomb perceived threats, particularly near nests.",
    "If Attacked": "Shield your face and move away slowly.",
    "Category": "Mammal",
    "Endemic": "No (introduced)",
    "Region": "Throughout the island, especially in urban and agricultural areas.",
    "Venom Type": "None",
    "Description": "The Common Myna ( *Acridotheres tristis*) is a medium-sized, brown bird with a black head, yellow beak, and distinctive yellow patches behind the eyes.  It's highly adaptable and thrives in a variety of habitats, from urban parks and gardens to agricultural lands and open woodlands.  An omnivorous bird, it feeds on insects, fruits, seeds, and scraps. Although considered an invasive species in many parts of the world, it plays a role in Sri Lanka's ecosystem as both a predator of insects and a disperser of seeds, while also competing with native species for resources."
  },
  {
    "Common Name": "House Crow",
    "Scientific Name": "Corvus splendens",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May become noisy and dive-bomb perceived threats, especially near nests.",
    "If Attacked": "Shield your head and face and move away quickly.",
    "Category": "Bird (While not a formal option, this is the correct category)",
    "Endemic": "No",
    "Region": "Throughout the island, especially in urban and suburban areas.",
    "Venom Type": "None",
    "Description": "The House Crow ( *Corvus splendens*) is a common bird in Sri Lanka, easily recognized by its glossy black plumage with a greyish-brown nape, breast, and belly.  It thrives in human-modified environments, including towns and villages, where it feeds opportunistically on garbage, scraps, and insects. Though generally not a threat to humans, it can become a nuisance due to its scavenging habits, noise, and potential to spread disease.  It plays a role in the ecosystem as a scavenger, cleaning up carrion and other waste, but can also negatively impact native bird populations through competition and predation."
  },
  {
    "Common Name": "Black-hooded Oriole",
    "Scientific Name": "Oriolus xanthornus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May give loud alarm calls and flit agitatedly from branch to branch.",
    "If Attacked": "Unlikely to attack. Simply retreat and leave the bird alone.",
    "Category": "Aves (Bird)",
    "Endemic": "No",
    "Region": "Widespread throughout the island, including dry lowlands, open woodlands, and cultivated areas.",
    "Venom Type": "None",
    "Description": "The Black-hooded Oriole ( *Oriolus xanthornus*) is a striking bird with bright yellow plumage contrasting sharply with its black head, throat, and wings. Its vibrant colours make it a conspicuous presence in the canopy of various habitats across Sri Lanka.  It primarily feeds on fruits, insects, and nectar, playing a role in seed dispersal and insect population control.  Their melodious calls contribute to the soundscape of Sri Lanka's diverse ecosystems. They build intricately woven nests suspended from tree branches.  While not endemic to Sri Lanka, it is a resident breeder throughout the island and a common sight."
  },
  {
    "Common Name": "White-throated Kingfisher",
    "Scientific Name": "Halcyon smyrnensis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May become vocal, puff up feathers, and dive at perceived threats.",
    "If Attacked": "Move away slowly. Attacks are rare and typically only occur when defending a nest.",
    "Category": "Bird (specifically Kingfisher)",
    "Endemic": "No",
    "Region": "Throughout the island, common near water bodies.",
    "Venom Type": "None",
    "Description": "The White-throated Kingfisher ( *Halcyon smyrnensis* ) is a brightly colored bird with a characteristic bright blue back, wings, and tail, a white throat and breast, and a chestnut-colored belly.  They are found throughout Sri Lanka near various water bodies, from coastal regions to inland reservoirs and rivers.  Primarily fish-eaters, they also consume crustaceans, insects, and small amphibians.  They play an important role in controlling aquatic invertebrate and small vertebrate populations, and their striking appearance contributes to the biodiversity and beauty of Sri Lanka's avifauna. They typically nest in burrows dug into riverbanks or earth mounds."
  },
  {
    "Common Name": "Pied Kingfisher",
    "Scientific Name": "Ceryle rudis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May become vocal and dive aggressively if nest is threatened, but generally avoids humans.",
    "If Attacked": "Move away slowly. Attacks are extremely rare and only occur if the nest is directly threatened.",
    "Category": "Bird (Note: while the provided categories don't include bird, this is the correct categorization)",
    "Endemic": "No",
    "Region": "Widespread throughout the island, especially near water bodies.",
    "Venom Type": "None",
    "Description": "The Pied Kingfisher ( *Ceryle rudis* ) is a striking black and white bird commonly found near rivers, lakes, reservoirs, and coastal areas of Sri Lanka.  They are easily recognized by their distinctive black and white plumage, crest, and double band across the chest. Pied Kingfishers are skilled fishers, hovering above the water before plunging in to catch their prey.  They play a vital role in aquatic ecosystems, controlling fish populations and acting as indicators of water quality.  They often perch conspicuously on branches, rocks, or even man-made structures near water. They are not endemic to Sri Lanka but are a widespread resident breeder."
  },
  {
    "Common Name": "Common Kingfisher",
    "Scientific Name": "Alcedo atthis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May give sharp calls and dive at perceived threats if cornered or defending a nest.  Generally avoids confrontation.",
    "If Attacked": "Leave the area calmly and slowly. It's highly unlikely for a kingfisher to attack a human unless defending its nest.",
    "Category": "Bird (While not provided, this is the appropriate category)",
    "Endemic": "No",
    "Region": "Widespread throughout the island, near various water bodies.",
    "Venom Type": "None",
    "Description": "The Common Kingfisher ( *Alcedo atthis*) is a vibrant, small bird with a striking blue back, orange underparts, and a large, dagger-like bill.  They are found near a variety of freshwater habitats across Sri Lanka, including rivers, streams, lakes, and even coastal areas.  Kingfishers primarily feed on small fish, which they hunt by diving from perches or hovering above the water. Their presence indicates a healthy aquatic ecosystem, as they are sensitive to pollution and habitat degradation.  They play a role in regulating fish populations and contribute to the overall biodiversity of their environment."
  },
  {
    "Common Name": "Red-vented Bulbul",
    "Scientific Name": "Pycnonotus cafer",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May become noisy and flutter around perceived threats, potentially pecking if cornered.",
    "If Attacked": "Move away slowly.  Their pecks are unlikely to cause serious harm.",
    "Category": "Bird (While not explicitly in the provided list, \"bird\" is the correct category)",
    "Endemic": "No",
    "Region": "Throughout the island, except for the highest altitudes.",
    "Venom Type": "None",
    "Description": "The Red-vented Bulbul ( *Pycnonotus cafer*) is a common bird in Sri Lanka, easily identified by its sleek dark brown upperparts, whitish underparts, and distinctive crimson-red patch beneath its tail. Its head is capped with a short crest, giving it a slightly mohawk-like appearance.  This adaptable bird thrives in a variety of habitats, from forests and scrublands to urban gardens and parks. It plays a vital role in seed dispersal and insect control, consuming a diet of fruits, nectar, and insects. Its loud, cheerful calls are a familiar sound in the Sri Lankan landscape."
  },
  {
    "Common Name": "Rose-ringed Parakeet",
    "Scientific Name": "Psittacula krameri",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May become noisy and bite if threatened or cornered.",
    "If Attacked": "Slowly back away and avoid direct eye contact.  Seek medical attention if bitten, as parrot bites can cause infection.",
    "Category": "Bird (Psittaciformes)",
    "Endemic": "No",
    "Region": "Throughout the island, including urban areas.",
    "Venom Type": "None",
    "Description": "The Rose-ringed Parakeet ( *Psittacula krameri* ) is a medium-sized parrot with vibrant green plumage, a distinctive rose-colored ring around its neck (more prominent in males), and a long tail.  They are highly adaptable birds found in a variety of habitats across Sri Lanka, from forests and woodlands to cultivated areas and urban parks.  Rose-ringed Parakeets are primarily herbivores, feeding on fruits, seeds, buds, and flowers, playing a role in seed dispersal. They are known for their loud, raucous calls and often form large, noisy flocks.  Although not native to Sri Lanka, they are a common and widespread species."
  },
  {
    "Common Name": "Asian Koel",
    "Scientific Name": "Eudynamys scolopaceus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Becomes noisy, may swoop at perceived threats if nesting.",
    "If Attacked": "Move away slowly. Encounters are rare as they are primarily arboreal.",
    "Category": "Bird (While not explicitly listed, it's the appropriate categorization.)",
    "Endemic": "No",
    "Region": "Throughout the island, including urban areas.",
    "Venom Type": "None",
    "Description": "The Asian Koel ( *Eudynamys scolopaceus* ) is a member of the cuckoo family, known for its distinct vocalizations and brood parasitic behavior. Males are glossy black with crimson eyes, while females exhibit a mottled brown and white plumage. They inhabit a wide range of wooded habitats, from forests to urban parks, and are primarily frugivores, feeding on fruits, berries, and occasionally insects.  As brood parasites, they lay their eggs in the nests of other birds, particularly crows and other corvids, leaving the host to raise their young. This strategy, while seemingly detrimental to the host species, plays a role in regulating insect populations and seed dispersal within their ecosystem."
  },
  {
    "Common Name": "Greater Coucal",
    "Scientific Name": "Centropus sinensis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May give loud, raucous calls, fluff up its feathers, and might strike with its strong beak and claws if cornered.",
    "If Attacked": "Slowly back away and give the bird space to escape.",
    "Category": "Bird",
    "Endemic": "No",
    "Region": "Throughout the island, except for the highest altitudes.",
    "Venom Type": "None",
    "Description": "The Greater Coucal, *Centropus sinensis*, is a large, non-parasitic cuckoo found throughout Sri Lanka in a variety of habitats from scrubland and forest edge to urban gardens.  It is characterized by its long tail, glossy black plumage, chestnut wings, and bright red eyes. Primarily terrestrial, it forages on the ground for insects, small reptiles, rodents, and occasionally bird eggs. The Greater Coucal plays an important role in controlling insect and rodent populations. They are known for their loud, echoing calls, often heard during the early morning and late afternoon."
  },
  {
    "Common Name": "Spotted Dove",
    "Scientific Name": "Spilopelia chinensis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Flies away quickly if disturbed. May give a series of alarm calls.",
    "If Attacked": "No specific action needed. They are not likely to attack.",
    "Category": "Bird (specifically, Dove)",
    "Endemic": "No",
    "Region": "Throughout the island, including urban areas, gardens, forests, and cultivated lands.",
    "Venom Type": "None",
    "Description": "The Spotted Dove ( *Spilopelia chinensis*) is a small, slender dove with a distinctive black and white spotted patch on the sides of its neck, giving it its name.  Its plumage is otherwise a light pinkish-brown, with darker brown wings.  Commonly found throughout Sri Lanka in various habitats, it plays a role in seed dispersal, contributing to plant diversity.  They primarily feed on grains, seeds, and small insects, foraging on the ground or in low vegetation. They build flimsy nests in trees and shrubs, where they lay two white eggs.  Their gentle cooing call is a familiar sound in Sri Lankan landscapes."
  },
  {
    "Common Name": "Little Egret",
    "Scientific Name": "Egretta garzetta",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May fly away if approached too closely, possibly giving a harsh squawk.",
    "If Attacked": "Unlikely to attack. Simply back away and give the bird space.",
    "Category": "Bird (While not a specific option, this is the correct category)",
    "Endemic": "No",
    "Region": "Throughout the island, especially near wetlands, coasts, and paddy fields.",
    "Venom Type": "None",
    "Description": "The Little Egret ( *Egretta garzetta* ) is a small, graceful white heron with a slender black beak, long black legs, and, in breeding plumage, two long nape plumes. Found across Sri Lanka in various wetland habitats including coastal lagoons, marshes, paddy fields, and even urban water bodies, it plays a vital role in the ecosystem by controlling populations of small fish, amphibians, crustaceans, and insects. Little Egrets are often seen wading patiently in shallow water, waiting to ambush prey. They are not endemic to Sri Lanka but are a common and widespread resident."
  },
  {
    "Common Name": "Cattle Egret",
    "Scientific Name": "Bubulcus ibis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May give alarm calls or try to fly away.  Could peck if cornered.",
    "If Attacked": "Give it space to escape. If pecked, wash the area thoroughly.",
    "Category": "Bird (Aves)",
    "Endemic": "No",
    "Region": "Widespread throughout the island.",
    "Venom Type": "None",
    "Description": "The Cattle Egret ( *Bubulcus ibis*) is a small white heron with a stocky build, a short yellow bill, and yellowish legs. During the breeding season, it develops buff-colored plumes on its head, back, and breast.  Found in a wide range of habitats from grasslands and wetlands to agricultural fields and urban areas, it often accompanies grazing livestock, feeding on insects and other small invertebrates stirred up by their movement. Cattle Egrets play a beneficial role in controlling insect populations and are a common sight in Sri Lanka's diverse landscapes. They are opportunistic feeders and also consume amphibians, reptiles and small mammals."
  },
  {
    "Common Name": "Indian Pond Heron",
    "Scientific Name": "Ardeola grayii",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May give a harsh squawk and fly away if approached too closely.  Can peck if cornered.",
    "If Attacked": "Give the bird space to escape.  If pecked, wash the area thoroughly.",
    "Category": "Amphibian",
    "Endemic": "No",
    "Region": "All regions",
    "Venom Type": "None",
    "Description": "The Indian Pond Heron ( *Ardeola grayii*) is a small heron, typically found near freshwater bodies like ponds, marshes, and lakes across Sri Lanka.  Its plumage is typically brown and streaked, providing excellent camouflage among reeds and other wetland vegetation.  They are patient hunters, waiting motionless for fish, frogs, and insects to come within striking distance.  They play a vital role in the ecosystem as both predator and prey, contributing to the balance of wetland ecosystems.  They are not endemic to Sri Lanka but are widely distributed across Asia."
  },
  {
    "Common Name": "Brahminy Kite",
    "Scientific Name": "Haliastur indus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Becomes vocal, circles overhead, may swoop or dive if nest is threatened.",
    "If Attacked": "Cover your head and face and move away from the nest area.",
    "Category": "Bird (specifically, a bird of prey)",
    "Endemic": "No",
    "Region": "Widespread throughout the island, including coastal areas, wetlands, and urban environments.",
    "Venom Type": "None",
    "Description": "The Brahminy Kite ( *Haliastur indus*) is a medium-sized bird of prey with a distinctive reddish-brown body and a white head and breast.  It is often seen soaring over coastal regions, rivers, lakes, and wetlands, as well as in urban areas.  A scavenger and opportunistic hunter, the Brahminy Kite plays a vital role in the ecosystem by controlling populations of fish, crabs, reptiles, and small mammals. They also help clean up carrion, contributing to environmental hygiene. They are known for their distinctive calls and often build their nests in tall trees."
  },
  {
    "Common Name": "White-bellied Sea Eagle",
    "Scientific Name": "Haliaeetus leucogaster",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low (unless provoked or defending a nest)",
    "Behavior (Agitated)": "Becomes vocal, displays aggressive postures like spreading wings and talons, may dive or swoop at perceived threats.",
    "If Attacked": "Shield your head and face, retreat slowly, avoid direct eye contact.",
    "Category": "Bird (Raptor)",
    "Endemic": "No",
    "Region": "Coastal regions, lagoons, large reservoirs, and rivers island-wide.",
    "Venom Type": "None",
    "Description": "The White-bellied Sea Eagle is a large bird of prey with a striking white head, chest, and underparts contrasting sharply with its dark grey wings and back.  Adults have a pale grey tail, while juveniles are mottled brown. Found along the coasts and larger waterways of Sri Lanka, they primarily feed on fish, often snatched from the surface of the water, but also opportunistically consume sea snakes, turtles, and waterbirds. They play a crucial role as apex predators in aquatic ecosystems, maintaining a healthy balance in prey populations.  Nesting occurs in tall trees near water, where they build large stick nests."
  },
  {
    "Common Name": "Little Cormorant",
    "Scientific Name": "Microcarbo niger",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May try to bite if cornered, but generally prefers to escape by flying or diving.",
    "If Attacked": "Move away slowly and give the bird space to escape.",
    "Category": "Bird (Not listed, adding as it's relevant)",
    "Endemic": "No",
    "Region": "Throughout the island, common near inland waters and coasts.",
    "Venom Type": "None",
    "Description": "The Little Cormorant ( *Microcarbo niger*) is a small, all-black waterbird commonly found across Sri Lanka's varied aquatic habitats, from coastal lagoons and mangroves to inland reservoirs and rivers.  These birds are excellent divers and fishers, playing a vital role in the aquatic ecosystem by controlling fish populations and contributing to nutrient cycling.  They are often seen perched on branches near the water, drying their wings in a characteristic spread-wing posture.  While not inherently aggressive, they can deliver a sharp peck if threatened, but generally prefer to avoid human interaction. Their plumage appears iridescent green in sunlight."
  },
  {
    "Common Name": "Indian Robin",
    "Scientific Name": "Copsychus fulicatus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May become more vocal, flick its tail, and display territorial behavior, but rarely attacks humans.",
    "If Attacked": "Highly unlikely. Simply back away slowly.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Throughout the island, including urban gardens, forests, and scrublands.",
    "Venom Type": "None",
    "Description": "The Indian Robin ( *Copsychus fulicatus*) is a small passerine bird with a striking black and rufous-chestnut plumage. Males are predominantly black with a contrasting white patch on the outer tail feathers, while females are slightly duller, exhibiting brownish-grey upperparts and a pale rufous breast. Found across the Indian subcontinent, including Sri Lanka, these birds are insectivores, playing a vital role in controlling insect populations. They are territorial and often seen foraging on the ground, hopping and flitting about in search of prey.  The Indian Robin's melodic calls are a familiar sound in many Sri Lankan habitats."
  },
  {
    "Common Name": "Pale-billed Flowerpecker",
    "Scientific Name": "Dicaeum erythrorhynchos",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May flit around rapidly and give high-pitched calls.",
    "If Attacked": "No specific action needed.  They are tiny and pose no threat to humans.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Throughout the island, except for the highest hills.",
    "Venom Type": "None",
    "Description": "The Pale-billed Flowerpecker ( *Dicaeum erythrorhynchos*) is a tiny, active bird found across Sri Lanka, excluding the highest altitudes. It has olive-brown upperparts, paler underparts, and a distinctive pale, slightly curved bill.  This small bird plays a vital role in seed dispersal for various plants, particularly mistletoes, whose sticky fruits they readily consume. They inhabit a range of habitats from forests and woodlands to cultivated areas and gardens, often seen flitting through foliage in search of insects, nectar, and fruit. Their high-pitched calls are a common sound in many Sri Lankan environments."
  },
  {
    "Common Name": "Purple-rumped Sunbird",
    "Scientific Name": "Leptocoma zeylonica",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May flit around erratically and chirp loudly.",
    "If Attacked": "No specific action needed.  They are unlikely to attack humans except in defense of their nest. Simply move away slowly.",
    "Category": "Bird (Aves)",
    "Endemic": "Yes",
    "Region": "Throughout the island, including all provinces, but less common in dense forests of the higher hills.",
    "Venom Type": "None",
    "Description": "The Purple-rumped Sunbird ( *Leptocoma zeylonica* ) is a small, vibrant bird with a metallic purple-blue rump, a maroon breast, and an olive-green back. Males are more brightly colored than females. They are nectarivores, playing a crucial role in pollination as they flit between flowers, using their long, curved bills to extract nectar. They are also known to consume insects and spiders, especially when feeding young. Their nests are pear-shaped and are often suspended from branches or leaves in gardens, scrubland, and open forests.  They are a common and delightful sight across Sri Lanka."
  },
  {
    "Common Name": "Common Tailorbird",
    "Scientific Name": "Orthotomus sutorius",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May flit around excitedly,.",
    "If Attacked": "No action needed. Highly unlikely to attack.",
    "Category": "Bird (While not an option, this is the correct categorization)",
    "Endemic": "No",
    "Region": "Throughout the island, including urban areas.",
    "Venom Type": "None",
    "Description": "The Common Tailorbird ( *Orthotomus sutorius*) is a small, active songbird recognized by its distinctive high-pitched call and unique nest-building technique. They are olive-green above and whitish below with a reddish-brown crown. Known for their remarkable nests, they sew together leaves using plant fibers and spider silk, creating a cradle for their eggs.  Common Tailorbirds are insectivores, playing a vital role in controlling insect populations in various habitats, from forests and scrublands to gardens and parks across Sri Lanka. They are a widespread species found throughout Asia."
  },
  {
    "Common Name": "Yellow-billed Babbler",
    "Scientific Name": "Turdoides affinis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Becomes noisy and may scold intruders with harsh chattering calls.",
    "If Attacked": "No specific action needed, they are unlikely to attack humans. Retreating slowly should suffice.",
    "Category": "Mammal",
    "Endemic": "Yes",
    "Region": "Widespread throughout the island, excluding the higher hills.",
    "Venom Type": "None",
    "Description": "The Yellow-billed Babbler ( *Turdoides affinis*) is a sociable, endemic bird of Sri Lanka, found in a variety of habitats from scrubland and open forest to home gardens. These chestnut-brown birds are characterized by their bright yellow beaks and are often seen foraging in noisy groups on the ground, flipping over leaves and debris in search of insects, small reptiles, and other invertebrates.  They play a vital role in controlling insect populations and contribute to seed dispersal.  Their communal breeding system, where several birds help raise the young, is a fascinating aspect of their social structure."
  },
  {
    "Common Name": "Rufous-backed Robin",
    "Scientific Name": "Copsychus malabaricus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May flick its tail and wings, give alarm calls, and potentially dive-bomb perceived threats if nesting.",
    "If Attacked": "No specific action needed, simply retreat.  Attacks are extremely rare and limited to nest defense.",
    "Category": "Mammal",
    "Endemic": "No",
    "Region": "Throughout the island, but more common in forested areas including the wet zone, dry zone, and foothills.",
    "Venom Type": "None",
    "Description": "The Rufous-backed Robin (Copsychus malabaricus) is a striking small bird with a jet-black head and breast, a vibrant orange-rufous back and belly, and a long, black tail often cocked upright.  It prefers dense vegetation in various habitats, from forests and woodlands to scrublands and even gardens. Primarily an insectivore, it forages on the ground and in undergrowth for insects, spiders, and other small invertebrates. Its beautiful song plays an important role in its territorial behavior and contributes to the soundscape of its environment. While widespread across South and Southeast Asia, Sri Lankan populations represent a distinct subspecies."
  },
  {
    "Common Name": "Black Drongo",
    "Scientific Name": "Dicrurus macrocercus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Becomes very vocal, may dive-bomb perceived threats.",
    "If Attacked": "Stay calm and move away slowly.  Attacks are rare and usually warning swoops.",
    "Category": "Bird (Passerine)",
    "Endemic": "No",
    "Region": "Throughout the island, except in dense forests. Common in open areas, cultivated lands, and urban environments.",
    "Venom Type": "None",
    "Description": "The Black Drongo is a medium-sized, glossy black bird with a distinctive forked tail.  It's highly adaptable and found across a range of habitats in Sri Lanka, from open fields and gardens to urban areas.  Known for its aerial prowess and insectivorous diet, it plays a crucial role in controlling insect populations.  The Black Drongo is also famous for its aggressive behavior towards larger birds, often chasing them away from its territory, earning it the nickname \"King Crow.\"  It's a vocal bird with a wide range of calls, often mimicking other species."
  },
  {
    "Common Name": "Little Swift",
    "Scientific Name": "Apus affinis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May make alarm calls and swoop close to perceived threats, but generally avoids human contact.",
    "If Attacked": "No specific action needed, as attacks are extremely rare. Simply move away slowly.",
    "Category": "Bird (Not listed in prompt categories, closest match would be none)",
    "Endemic": "No",
    "Region": "Widespread throughout the island.",
    "Venom Type": "None",
    "Description": "The Little Swift ( *Apus affinis*) is a small, dark brown bird with a pale throat and a short, forked tail. They are highly aerial, spending almost their entire lives on the wing, feeding on insects caught in flight.  Commonly found nesting in colonies under eaves of buildings, cliffs, and bridges across Sri Lanka, these birds play a crucial role in controlling insect populations.  Their nests are made of feathers, straw, and other materials glued together with saliva. While not endemic to Sri Lanka, they are a widespread and common sight throughout the island's diverse habitats."
  },
  {
    "Common Name": "Barn Swallow",
    "Scientific Name": "Hirundo rustica",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Becomes vocal, may swoop close to perceived threat.",
    "If Attacked": "No specific action needed, highly unlikely to attack humans unless nest is directly threatened.",
    "Category": "Bird (While not explicitly in the provided list, it's the correct categorization)",
    "Endemic": "No",
    "Region": "Widespread throughout the island, especially in open areas and around human settlements.",
    "Venom Type": "None",
    "Description": "The Barn Swallow (*Hirundo rustica*) is a small, migratory bird with a distinctive forked tail and iridescent blue-black upperparts, contrasting with a rufous forehead and throat. They are commonly found across Sri Lanka during migration, often seen swooping low over fields, wetlands, and urban areas, catching insects in flight. These agile aerial insectivores play a crucial role in controlling insect populations and are considered beneficial to the ecosystem.  They build mud nests, often attached to the underside of eaves or bridges."
  },
  {
    "Common Name": "House Sparrow",
    "Scientific Name": "Passer domesticus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May chirp loudly, flutter wings, and peck if feeling threatened, especially near their nest.",
    "If Attacked": "Leave the area and avoid further disturbing the bird.",
    "Category": "Bird (While not explicitly listed, this is the correct category)",
    "Endemic": "No",
    "Region": "Throughout the island, especially in urban and agricultural areas.",
    "Venom Type": "None",
    "Description": "The House Sparrow ( *Passer domesticus*) is a small, brownish-grey bird with a stout build and a conical bill. Males have a distinctive black bib and grey crown, while females are more uniformly brown. They are highly adaptable and thrive in human-modified environments, building nests in crevices, eaves, and other structures.  House Sparrows are primarily seed-eaters but also consume insects, particularly during breeding season.  They play a role in controlling insect populations and contribute to seed dispersal, although their competition with native species for resources can sometimes be a concern.  They are a common and widespread species found throughout Sri Lanka."
  },
  {
    "Common Name": "Sri Lanka Swallow",
    "Scientific Name": "Hirundo hyperythra",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May swoop and vocalize loudly if nest is threatened.",
    "If Attacked": "No specific action needed, simply move away from the nest area.",
    "Category": "Bird (Aves)",
    "Endemic": "Yes",
    "Region": "Throughout the island, but more common in hills and lower montane areas.",
    "Venom Type": "None",
    "Description": "The Sri Lanka Swallow ( *Hirundo hyperythra* ) is a medium-sized, brightly colored bird with deep blue upperparts, a rufous forehead, throat and upper breast, and a broad rufous band across the lower breast. It has a deeply forked tail. This insectivore is often seen swooping through the air catching flying insects, playing a vital role in controlling insect populations. It builds mud nests, often on cliff faces, bridges, and buildings. Although endemic to Sri Lanka, it is relatively widespread across the island, particularly favoring hilly and lower montane regions where suitable nesting sites are found.  They contribute to the biodiversity and ecosystem health by regulating insect populations."
  },
  {
    "Common Name": "Common Tree Frog",
    "Scientific Name": "Polypedates maculatus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May jump or try to escape.",
    "If Attacked": "Leave it alone; it poses no threat.",
    "Category": "Amphibian",
    "Endemic": "No",
    "Region": "Throughout the island, including North Western, Central, Northern, Southern, Sabaragamuwa, Uva, Eastern, and Western provinces.",
    "Venom Type": "None",
    "Description": "The Common Tree Frog ( *Polypedates maculatus* ) is a widely distributed frog species found across South and Southeast Asia, including Sri Lanka. It's a medium-sized frog with variable coloration, typically exhibiting shades of brown, gray, or green, often with mottled patterns.  They are arboreal, preferring habitats with trees, shrubs, and vegetation near water sources. Their sticky toe pads aid in climbing. Common Tree Frogs play a vital role in the ecosystem by controlling insect populations, serving as prey for larger animals, and contributing to the overall biodiversity of their habitat."
  },
  {
    "Common Name": "Common Paddy Frog",
    "Scientific Name": "Fejervarya limnocharis",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May jump or try to hide.",
    "If Attacked": "Leave it alone; it poses no threat.",
    "Category": "Amphibian",
    "Endemic": "No",
    "Region": "Throughout the island, including lowlands and some hilly areas.",
    "Venom Type": "None",
    "Description": "The Common Paddy Frog ( *Fejervarya limnocharis*) is a widespread frog species found in various habitats across Sri Lanka, from paddy fields and marshes to gardens and urban areas.  They are typically brown or olive-green with variable patterns, including dark stripes or spots, and have a relatively pointed snout. These frogs play a crucial role in controlling insect populations and serve as a food source for larger predators.  They breed in stagnant water bodies, where their tadpoles contribute to the aquatic ecosystem."
  },
  {
    "Common Name": "Marbled Toad",
    "Scientific Name": "Duttaphrynus melanostictus",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Inflates its body, secretes milky poison from parotoid glands behind the eyes. May try to hop away.",
    "If Attacked": "Wash exposed skin thoroughly with soap and water.  Seek medical attention if irritation persists.",
    "Category": "Amphibian",
    "Endemic": "No",
    "Region": "Throughout the island, including urban areas.",
    "Venom Type": "Mild",
    "Description": "The Marbled Toad ( *Duttaphrynus melanostictus*) is a common, widespread toad in Sri Lanka.  It's a medium to large-sized amphibian with rough, warty skin, typically displaying a mottled brown or greyish pattern, hence its name. They inhabit a variety of environments, from forests and grasslands to human settlements, often found near water sources. Primarily nocturnal, they play a vital role in controlling insect populations, consuming a variety of invertebrates. While their parotoid glands secrete a milky, irritating substance as a defense mechanism, they are not considered highly dangerous to humans unless the secretion comes into contact with mucous membranes or open wounds."
  },
  {
    "Common Name": "Tilapia",
    "Scientific Name": "Oreochromis niloticus",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May attempt to bite or flee.",
    "If Attacked": "Move away slowly.  Their bites are generally not serious.",
    "Category": "Amphibian (Fish - more specifically)",
    "Endemic": "No",
    "Region": "Widespread in freshwater habitats across the island.",
    "Venom Type": "None",
    "Description": "Nile Tilapia (Oreochromis niloticus) is a freshwater fish introduced to Sri Lanka and now widely found in reservoirs, rivers, ponds, and even some brackish water systems.  They are characterized by their deep-bodied shape, laterally compressed form, and interrupted lateral lines. Tilapia are opportunistic omnivores, feeding on algae, aquatic plants, small invertebrates, and detritus. Although considered a valuable food source, their invasive nature can disrupt native ecosystems by outcompeting indigenous fish species and altering habitat structure.  They play a role as both predator and prey, impacting aquatic food webs."
  },
  {
    "Common Name": "Rohu",
    "Scientific Name": "Labeo rohita",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Likely to try to escape quickly by swimming away.",
    "If Attacked": "Not applicable, as Rohu are not known to attack humans.",
    "Category": "Fish (Technically a bony fish under the superclass Osteichthyes, though not an option provided)",
    "Endemic": "No (Introduced)",
    "Region": "Throughout the island in reservoirs and rivers.",
    "Venom Type": "None",
    "Description": "The Rohu ( *Labeo rohita*) is a large, silver-colored freshwater fish with a prominent head and downturned mouth adapted for bottom feeding.  Native to South Asia, it has been introduced to Sri Lanka and is widely farmed for food due to its fast growth and palatable flesh.  In Sri Lanka, it inhabits reservoirs, rivers, and other freshwater bodies, where it plays a role in nutrient cycling and serves as a food source for larger predatory fish. Although primarily herbivorous, consuming algae and plant matter, they may also opportunistically feed on insects and other small invertebrates."
  },
  {
    "Common Name": "Sri Lankan Krait",
    "Scientific Name": "Bungarus ceylonicus",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Hoods, hisses, and strikes repeatedly.",
    "If Attacked": "Seek immediate medical attention. Antivenom is crucial.",
    "Category": "Snake",
    "Endemic": "Yes",
    "Region": "Lowland dry zone, including North Western, Northern, and parts of Eastern provinces.",
    "Venom Type": "Neurotoxic",
    "Description": "The Sri Lankan krait ( *Bungarus ceylonicus*) is a highly venomous elapid snake characterized by its glossy black scales with single or paired white crossbands. It inhabits primarily the lowland dry zone of Sri Lanka, preferring areas with loose soil and leaf litter, often found near human settlements.  Nocturnal by nature, it preys on other snakes, lizards, and occasionally small rodents, playing a crucial role in regulating prey populations. The Sri Lankan krait's neurotoxic venom acts rapidly, affecting the nervous system and causing paralysis.  Its bite can be fatal to humans if left untreated."
  },
  {
    "Common Name": "Merrem's Hump-nosed Pit Viper",
    "Scientific Name": "Hypnale hypnale",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Becomes highly agitated when threatened, coiling tightly, flattening its head, hissing loudly, and striking repeatedly.",
    "If Attacked": "Seek immediate medical attention.  Immobilize the affected limb and remain calm to slow venom spread. Traditional remedies are not effective.",
    "Category": "Snake",
    "Endemic": "Yes",
    "Region": "Throughout the island, including lowlands, wet zone, and some parts of the dry zone.",
    "Venom Type": "Hemotoxic",
    "Description": "Merrem's Hump-nosed Pit Viper ( *Hypnale hypnale* ) is a small, stout-bodied venomous snake with a distinctly upturned snout, giving it its common name.  Its coloration varies from yellowish-brown to reddish-brown, with dark brown or black markings that often resemble a chain-like pattern. Found in a range of habitats from rainforests and grasslands to agricultural areas and even near human settlements, it is primarily a nocturnal hunter, feeding mainly on small rodents, lizards, and frogs, playing a crucial role in controlling their populations.  Its hemotoxic venom causes severe pain, swelling, and localized tissue damage, and can be life-threatening without proper medical treatment."
  },
  {
    "Common Name": "Lowland Hump-nosed Pit Viper",
    "Scientific Name": "Hypnale hypnale",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Becomes highly defensive, coils tightly, vibrates its tail, and may strike repeatedly.",
    "If Attacked": "Seek immediate medical attention. Immobilize the affected limb and stay calm to slow venom spread.",
    "Category": "Snake",
    "Endemic": "Yes",
    "Region": "Throughout the island, particularly in the wet zone and lower hills of the dry zone.",
    "Venom Type": "Hemotoxic",
    "Description": "The Lowland Hump-nosed Pit Viper ( *Hypnale hypnale* ) is a small, stout-bodied venomous snake recognized by its triangular head, upturned snout, and reddish-brown or brown coloration with darker bands or blotches.  It favors moist, leaf-littered environments in forests, plantations, and even gardens, often hiding under rocks or logs. Primarily nocturnal, it preys on small vertebrates like lizards, frogs, and rodents, playing a role in controlling their populations. Its hemotoxic venom causes severe pain, swelling, and tissue damage, posing a significant threat to humans."
  },
  {
    "Common Name": "Sri Lankan Hump-nosed Pit Viper",
    "Scientific Name": "Hypnale nepa",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Becomes highly defensive, coils tightly, hisses loudly, and strikes readily.",
    "If Attacked": "Seek immediate medical attention. Antivenom is available.",
    "Category": "Snake",
    "Endemic": "Yes",
    "Region": "Throughout the island, including wet zone, dry zone, and intermediate zones, but particularly common in the southwestern wet lowlands.",
    "Venom Type": "Hemotoxic",
    "Description": "The Sri Lankan Hump-nosed Pit Viper (Hypnale nepa) is a small, stout venomous snake recognizable by its triangular head with a prominent pointed snout or \"humped nose.\"  Its coloration varies from reddish-brown to yellowish-brown, often with darker blotches or stripes, providing excellent camouflage among leaf litter and undergrowth in its diverse habitats, ranging from rainforests and lowlands to plantations and even gardens.  This nocturnal ambush predator plays a significant role in controlling rodent populations. Its hemotoxic venom causes severe local pain, swelling, and tissue damage, and can be life-threatening without prompt treatment."
  },
  {
    "Common Name": "Green Pit Viper",
    "Scientific Name": "Trimeresurus trigonocephalus",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Becomes highly agitated when threatened, coiling tightly, vibrating its tail, and striking readily.",
    "If Attacked": "Seek immediate medical attention.  Immobilize the affected limb and remain calm to slow venom spread.",
    "Category": "Snake",
    "Endemic": "Yes",
    "Region": "Throughout the island, but more common in the wet zone including the south-western parts, central highlands, and Sabaragamuwa.",
    "Venom Type": "Hemotoxic",
    "Description": "The Green Pit Viper (*Trimeresurus trigonocephalus*) is a striking venomous snake endemic to Sri Lanka.  It is characterized by its vibrant green coloration, triangular head with loreal pits, and reddish-orange tail tip.  Primarily arboreal, it inhabits rainforests, wet lowlands, and tea plantations. Its hemotoxic venom causes severe pain, swelling, and tissue damage.  As an ambush predator, it plays a crucial role in regulating rodent populations and is, in turn, preyed upon by larger reptiles and birds."
  },
  {
    "Common Name": "Sri Lankan Keelback   Blossom Krait",
    "Scientific Name": "Rhabdophis ceylonensis",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "When threatened, the Sri Lankan keelback flattens its neck, similar to a cobra, and may bite.",
    "If Attacked": "Seek immediate medical attention, even though fatalities are rare. Describe the snake to medical professionals.",
    "Category": "Snake",
    "Endemic": "Yes",
    "Region": "Throughout the island, including lowlands, hills, and submontane areas.",
    "Venom Type": "Mild, primarily Hemotoxic (affects blood clotting) with some Neurotoxic components.",
    "Description": "The Sri Lankan keelback, also known as the Ceylon keelback or blossom krait due to its superficial resemblance to kraits, is a medium-sized snake with a distinctive keel along its back.  Its coloration is variable, typically olive-brown to dark brown with black crossbars and often a light vertebral stripe. It inhabits a variety of habitats from forests and grasslands to agricultural lands and even urban gardens.  It plays an important role in controlling rodent and frog populations, but its venom, while rarely fatal to humans, can cause localized pain, swelling, and bleeding disorders. It is rear-fanged, meaning its venom-delivering fangs are located at the back of its upper jaw, making envenomation less common than with front-fanged snakes."
  },
  {
    "Common Name": "Barnes's Cat Snake",
    "Scientific Name": "Boiga barnesii",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May flatten its neck defensively, hiss, and strike.",
    "If Attacked": "Wash the bite area thoroughly with soap and water. Seek medical attention if symptoms develop.",
    "Category": "Snake",
    "Endemic": "Yes",
    "Region": "Dry and intermediate zones, including North Western, North Central, and parts of Eastern provinces.",
    "Venom Type": "Mild, primarily affecting localized tissue.",
    "Description": "Barnes's Cat Snake ( *Boiga barnesii* ) is a slender, rear-fanged colubrid snake endemic to Sri Lanka's dry and intermediate zones.  It possesses large, cat-like eyes, hence its common name. Typically, its coloration ranges from grayish-brown to reddish-brown, with darker crossbars or blotches. It is primarily arboreal, inhabiting forests, scrublands, and even human settlements.  A nocturnal predator, it feeds on lizards, geckos, and frogs, playing a role in controlling their populations. While mildly venomous, its bite poses little threat to humans beyond localized pain and swelling."
  },
  {
    "Common Name": "Beddome's Cat Snake",
    "Scientific Name": "Boiga beddomei",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Can become defensive, flattening its neck, hissing, and striking.",
    "If Attacked": "Seek immediate medical attention, although effects are usually localized and not life-threatening.",
    "Category": "Snake",
    "Endemic": "Yes",
    "Region": "Throughout the island, including dry and intermediate zones, and up to mid-hills.",
    "Venom Type": "Mild, primarily causing localized pain and swelling.",
    "Description": "Beddome's Cat Snake ( *Boiga beddomei* ) is a slender, rear-fanged colubrid snake with large eyes that provide excellent night vision. Its coloration is typically light brown or grayish with darker brown or black crossbars.  It is an arboreal species found in forests, plantations, and even near human settlements, often hiding amongst foliage. A nocturnal predator, it primarily feeds on lizards and geckoes, playing a role in controlling their populations.  Though mildly venomous, its bite is rarely dangerous to humans, posing more of a nuisance than a serious threat."
  },
  {
    "Common Name": "Sri Lanka Cat Snake",
    "Scientific Name": "Boiga ceylonensis",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Can become defensive, flattening its head, hissing, and striking if threatened.",
    "If Attacked": "Seek medical attention, though effects are usually localized and mild.  Clean and disinfect the bite area.",
    "Category": "Snake",
    "Endemic": "Yes",
    "Region": "Throughout the island, including dry lowlands, forested hills, and human settlements.",
    "Venom Type": "Mild, primarily cytotoxic",
    "Description": "The Sri Lanka Cat Snake ( *Boiga ceylonensis*) is a slender, rear-fanged colubrid snake with large eyes and a distinctly cat-like pupil.  Coloration varies from grayish-brown to yellowish with darker crossbars or blotches, providing excellent camouflage in its diverse habitats.  It is a nocturnal, arboreal predator, feeding primarily on lizards, geckos, frogs, and occasionally small birds and mammals.  Its venom is primarily used to subdue prey and poses a low risk to humans, typically causing localized swelling and pain.  The Sri Lanka Cat Snake plays an essential role in controlling reptile and amphibian populations within its ecosystem."
  },
  {
    "Common Name": "Sri Lankan Coral Snake",
    "Scientific Name": "Calliophis bivirgata flaviceps",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Hoods (flattens neck region), may strike repeatedly.",
    "If Attacked": "Seek immediate medical attention. Antivenom is crucial.",
    "Category": "Snake",
    "Endemic": "Yes (the *flaviceps* subspecies)",
    "Region": "Primarily wet zone and lower hills of southwestern Sri Lanka, including parts of Sabaragamuwa and Southern Provinces",
    "Venom Type": "Neurotoxic",
    "Description": "The Sri Lankan Coral Snake (*Calliophis bivirgata flaviceps*) is a strikingly beautiful but highly venomous elapid.  It's characterized by its iridescent blue-black body, a bright red belly, and a distinct yellow or orange head.  This subspecies is endemic to Sri Lanka and primarily inhabits the leaf litter and moist undergrowth of rainforests and lower montane forests. It plays a crucial role in the ecosystem by controlling populations of small reptiles and amphibians, which constitute its primary diet.  Despite its potent venom, it's generally a secretive and non-aggressive snake, preferring to avoid confrontation.  However, if threatened or cornered, it will defend itself vigorously."
  },
  {
    "Common Name": "Dog-faced Water Snake",
    "Scientific Name": "Cerberus rynchops",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Flattens its head and neck, may hiss, and tries to bite.",
    "If Attacked": "Wash the bite thoroughly with soap and water. Seek medical attention if symptoms develop.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "All coastal regions, including mangroves, estuaries, and lagoons.",
    "Venom Type": "Mild, primarily cytotoxic.",
    "Description": "The Dog-faced Water Snake ( *Cerberus rynchops*) is a rear-fanged, mildly venomous snake commonly found in brackish and saltwater habitats throughout coastal Sri Lanka and much of South and Southeast Asia. It gets its name from its upturned snout, which aids in surfacing to breathe.  These snakes are typically olive-brown to grayish in color, with darker crossbands. They are nocturnal hunters, feeding primarily on fish, crustaceans, and amphibians. While their venom is not considered dangerous to humans, a bite can cause localized pain, swelling, and itching. They play a role in controlling prey populations in their aquatic ecosystems."
  },
  {
    "Common Name": "Flying Snake   Gold and Black Tree Snake",
    "Scientific Name": "Chrysopelea ornata",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May become defensive, flatten its head slightly, and hiss.  Attempts to flee are common.",
    "If Attacked": "Move away slowly and allow the snake to escape. Seek medical advice if bitten, though symptoms are typically mild and localized.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "Throughout the island, including dry zone, lowlands, and up to mid-hills.",
    "Venom Type": "Mild, primarily used for subduing prey, not considered medically significant for humans.",
    "Description": "The Ornate Flying Snake ( *Chrysopelea ornata*) is a diurnal, arboreal colubrid known for its gliding ability.  It flattens its body and uses lateral undulations to fly between trees, covering considerable distances.  This slender snake, typically green or yellowish with black crossbars and ornamental patterns, is commonly found in forests, plantations, and even gardens, where it preys on lizards, geckos, frogs, bats, and small birds.  Its venom plays a role in subduing prey, contributing to the balance of the ecosystem, but poses minimal risk to humans."
  },
  {
    "Common Name": "Hook-nosed Sea Snake",
    "Scientific Name": "Enhydrina schistosa",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "When threatened, it flattens its body, raises its head and anterior part of the body in an S-shape, and may strike repeatedly.",
    "If Attacked": "Seek immediate medical attention. Antivenom is available.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "All coastal waters",
    "Venom Type": "Neurotoxic and Myotoxic",
    "Description": "The hook-nosed sea snake ( *Enhydrina schistosa*) is a highly venomous elapid found in the tropical waters of the Indian and Pacific Oceans, including the coastal waters around Sri Lanka.  It's characterized by a distinct upturned snout and a robust body, usually grey or olive-green with darker crossbands.  These snakes are active hunters, primarily feeding on fish in shallow coastal waters, estuaries, and even rivers. They play a vital role in controlling fish populations and are, in turn, preyed upon by larger marine animals.  Their potent venom, a combination of neurotoxins and myotoxins, poses a significant threat to humans, with bites requiring immediate medical intervention."
  },
  {
    "Common Name": "Stokes' Sea Snake",
    "Scientific Name": "Hydrophis stokesii",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "When threatened, Stokes' Sea Snake flattens its body, hisses, and may strike repeatedly.",
    "If Attacked": "Seek immediate medical attention.  Sea snake venom is highly potent and requires antivenom.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "Coastal waters around Sri Lanka",
    "Venom Type": "Myotoxic (primarily), Neurotoxic (secondary)",
    "Description": "Stokes' Sea Snake ( *Hydrophis stokesii*) is a robust, large sea snake with distinctive black crossbands on a yellow or grey body.  It can grow up to 1.5 meters in length and has a noticeably flattened, paddle-like tail for propulsion in marine environments. This species inhabits coastal waters, estuaries, and coral reefs around Sri Lanka and across the Indo-Pacific.  Stokes' Sea Snake is a predator, primarily feeding on catfish and pufferfish, playing a role in controlling fish populations within its ecosystem. Its venom is highly potent and dangerous to humans, affecting muscle tissue and the nervous system."
  },
  {
    "Common Name": "Peter's Sea Snake",
    "Scientific Name": "Hydrophis platurus xanthurus",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Becomes defensive, may flatten its body and neck, and strike repeatedly if threatened.",
    "If Attacked": "Seek immediate medical attention.  Immobilize the affected limb and minimize movement.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "All coastal waters",
    "Venom Type": "Neurotoxic",
    "Description": "Peter's Sea Snake ( *Hydrophis platurus xanthurus*) is a pelagic sea snake found in tropical waters around Sri Lanka and throughout the Indo-Pacific.  This subspecies displays a distinctive yellow belly and tail contrasting with a black or dark brown back. Its laterally compressed, paddle-like tail aids in swimming in the open ocean where it preys primarily on fish. While generally docile and reluctant to bite, its venom is highly potent and neurotoxic, posing a serious threat to humans if bitten. Its role in the ecosystem involves controlling fish populations and serving as prey for larger marine animals."
  },
  {
    "Common Name": "Gray's Sea Snake",
    "Scientific Name": "Hydrophis gracilis",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "When threatened, Gray's Sea Snake flattens its body and may strike repeatedly.  It is generally considered more aggressive than other sea snakes.",
    "If Attacked": "Seek immediate medical attention. Sea snake venom is potent and requires antivenom.  Immobilize the affected limb and minimize movement.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "All coastal waters",
    "Venom Type": "Neurotoxic",
    "Description": "Gray's Sea Snake ( *Hydrophis gracilis*) is a slender, marine serpent with a distinctly small head and a laterally compressed tail for propulsion.  Coloration varies from grey to olive-brown with darker crossbands, which may fade with age. Found throughout the coastal waters of Sri Lanka and the wider Indo-Pacific, this species inhabits shallow coral reefs, estuaries, and mangroves. It plays a crucial role in the marine ecosystem, primarily feeding on small fish and eels.  Gray's Sea Snake is a prolific breeder, giving birth to live young in the water.  Its neurotoxic venom poses a significant threat to humans, requiring prompt medical attention if bitten."
  },
  {
    "Common Name": "Guenther's Sea Snake",
    "Scientific Name": "Hydrophis guentheri",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Can become highly agitated if cornered or threatened, displaying defensive postures and striking readily.",
    "If Attacked": "Seek immediate medical attention. Antivenom is available.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "All coastal waters.",
    "Venom Type": "Neurotoxic",
    "Description": "Gnther's sea snake ( *Hydrophis guentheri*) is a fully aquatic species found in coastal marine environments throughout South and Southeast Asia, including the waters surrounding Sri Lanka.  It has a distinctive flattened, paddle-like tail adapted for swimming and a relatively small head compared to its robust body. The coloration varies from olive-gray to dark brown with lighter crossbands, which often fade with age. Primarily a piscivore, it feeds on bottom-dwelling fish and eels.  Its potent neurotoxic venom plays a crucial role both in subduing prey and as a defense mechanism. Though not inherently aggressive, its potent venom makes it a significant hazard to humans, particularly fishermen. They are an important part of the marine food chain, contributing to the balance of the ecosystem."
  },
  {
    "Common Name": "Jerdon's Sea Snake",
    "Scientific Name": "Hydrophis jerdonii",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Can be highly defensive when cornered or threatened, displaying rapid head movements, flattening its body, and attempting to bite.",
    "If Attacked": "Seek immediate medical attention.  Sea snake venom is highly potent.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "Coastal waters around Sri Lanka.",
    "Venom Type": "Neurotoxic",
    "Description": "Jerdon's Sea Snake ( *Hydrophis jerdonii* ) is a relatively small, fully aquatic sea snake with a distinctive dark back and yellow belly, although coloration can vary. They inhabit shallow coastal marine environments, particularly estuaries, mangroves, and seagrass beds,  feeding primarily on fish and crustaceans.  Their neurotoxic venom is highly dangerous to humans, though they are not typically aggressive unless provoked. As an apex predator within its specific niche, Jerdon's Sea Snake plays a significant role in regulating prey populations and maintaining the balance of the marine ecosystem."
  },
  {
    "Common Name": "Shaw's Sea Snake",
    "Scientific Name": "Hydrophis shawii",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Can be highly aggressive if threatened, displaying rapid head movements and striking repeatedly.",
    "If Attacked": "Seek immediate medical attention.  Antivenom is crucial. Immobilize the affected limb and stay calm to slow venom spread.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "All coastal waters",
    "Venom Type": "Neurotoxic",
    "Description": "Shaw's Sea Snake ( *Hydrophis shawii* ) is a slender, yellow-and-black banded sea snake found in the tropical waters of the Indian Ocean, including all coastal regions of Sri Lanka. These venomous reptiles are adapted to a fully marine existence, possessing a paddle-like tail for propulsion and specialized salt glands for excretion.  They primarily inhabit shallow coastal waters and estuaries, feeding on fish and eels.  Their neurotoxic venom is highly potent and poses a significant threat to humans.  While they play a vital role in the marine ecosystem by controlling fish populations, they should be avoided at all costs due to their defensive nature and dangerous venom."
  },
  {
    "Common Name": "Chittul Sea Snake",
    "Scientific Name": "Hydrophis mamillaris",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "When threatened, it flattens its body and may bite defensively.  It's generally considered more placid than some other sea snakes, but caution is always advised.",
    "If Attacked": "Seek immediate medical attention. Sea snake venom can be highly potent and requires specialized antivenom. Immobilize the affected limb and stay calm to slow venom spread.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "Coastal waters around Sri Lanka",
    "Venom Type": "Neurotoxic and Myotoxic",
    "Description": "The Chittul Sea Snake (Hydrophis mamillaris), recognizable by its distinctive bumpy scales, is a venomous sea snake found in the coastal waters of Sri Lanka, as well as other parts of the Indian Ocean and Southeast Asia.  It inhabits shallow coral reefs, estuaries, and mangrove forests, preying primarily on fish.  Their neurotoxic and myotoxic venom is potent and dangerous to humans.  While playing a role in controlling fish populations, they are also preyed upon by larger marine animals like sharks and sea eagles.  Their bumpy scales are believed to aid in camouflage and potentially reduce drag in the water."
  },
  {
    "Common Name": "John's Sea Snake",
    "Scientific Name": "Hydrophis johnsonii",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Becomes highly agitated if cornered or threatened, flattening its body and striking repeatedly.",
    "If Attacked": "Seek immediate medical attention. Antivenom is available.  Immobilize the affected limb and apply a pressure immobilization bandage if possible.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "Northern, North Western (coastal waters)",
    "Venom Type": "Neurotoxic",
    "Description": "John's Sea Snake ( *Hydrophis johnsonii* ) is a robust, highly venomous sea snake with striking banded patterns of black or dark brown and cream or yellow.  It inhabits coastal waters and estuaries of northern and north-western Sri Lanka, though its range extends beyond into other parts of the Indian Ocean.  Primarily feeding on fish, it plays a role in regulating fish populations within its ecosystem.  Its neurotoxic venom poses a significant threat to humans, though it's typically not aggressive unless provoked.  This species is characterized by a distinctive head that is only slightly wider than its neck, a trait that distinguishes it from other similar sea snakes."
  },
  {
    "Common Name": "Yellow-bellied Sea Snake",
    "Scientific Name": "Hydrophis platurus",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "May become highly agitated if threatened, flattening its body and striking repeatedly.",
    "If Attacked": "Seek immediate medical attention. Antivenom is available. Avoid any movement that may further agitate the snake.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "All coastal waters",
    "Venom Type": "Neurotoxic and Myotoxic",
    "Description": "The Yellow-bellied Sea Snake ( *Hydrophis platurus* ) is a pelagic species found in tropical ocean waters around the world, including all coastal regions of Sri Lanka. It is characterized by its distinctive yellow underside and black or dark brown back.  This fully aquatic snake has a laterally compressed, paddle-like tail adapted for swimming. They are typically found in the open ocean, often drifting in large aggregations, and feed primarily on small fish.  Their venom, a potent mix of neurotoxins and myotoxins, is extremely dangerous to humans, but bites are rare due to their typically placid nature unless provoked.  They play a vital role in the marine ecosystem as both predator and prey."
  },
  {
    "Common Name": "Schmidt's Sea Snake",
    "Scientific Name": "Hydrophis schmidti",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "When threatened, Schmidt's Sea Snake flattens its body, hisses, and may strike repeatedly.  It is generally considered more aggressive than other sea snakes.",
    "If Attacked": "Seek immediate medical attention. Sea snake antivenom is crucial for survival.",
    "Category": "Snake",
    "Endemic": "No",
    "Region": "Coastal waters around the entire island.",
    "Venom Type": "Neurotoxic",
    "Description": "Schmidt's Sea Snake ( *Hydrophis schmidti*) is a robust marine serpent with a distinctive, laterally compressed body, a paddle-like tail for propulsion, and valvular nostrils. Its coloration varies from dark grey or olive to cream with darker bands.  Found in shallow coastal waters, estuaries, and mangrove forests throughout the Indo-Pacific region, including Sri Lanka, it feeds primarily on eels and other bottom-dwelling fish. Its neurotoxic venom is exceptionally potent, posing a significant threat to humans.  It plays an important role in controlling fish populations in its ecosystem.  While it avoids contact with humans, it can be provoked if accidentally stepped on or cornered."
  },
  {
    "Common Name": "Sri Lankan Ornamental Tarantula",
    "Scientific Name": "Poecilotheria fasciata",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Raises front legs and bares fangs in a threat display, may strike rapidly.",
    "If Attacked": "Seek immediate medical attention.",
    "Category": "Spider (Arachnid)",
    "Endemic": "Yes",
    "Region": "North Western, Central, dry zone",
    "Venom Type": "Neurotoxic",
    "Description": "The Sri Lankan Ornamental Tarantula ( *Poecilotheria fasciata*) is a large, arboreal spider with striking yellow and black banding on its legs.  It inhabits the dry zone forests of north-western and central Sri Lanka, constructing silken retreats in tree hollows or under loose bark.  Primarily nocturnal, it ambushes flying insects and small vertebrates. While its venom is potent and neurotoxic, posing a medical risk to humans, it plays a crucial role in controlling insect populations within its ecosystem.  It is considered a threatened species due to habitat loss and the illegal pet trade."
  },
  {
    "Common Name": "Brown Widow Spider",
    "Scientific Name": "Latrodectus geometricus",
    "Poison Level": "Moderately Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "When disturbed, the brown widow may rapidly shake its web, creating a blur to deter predators. They are generally timid and prefer to retreat rather than attack.",
    "If Attacked": "Seek immediate medical attention. While bites are rarely fatal, they can cause pain, muscle cramps, and other systemic effects, particularly in children and the elderly.",
    "Category": "Spider (Arachnid)",
    "Endemic": "No",
    "Region": "Throughout the island, particularly in urban areas and human dwellings.",
    "Venom Type": "Neurotoxic",
    "Description": "The brown widow spider ( *Latrodectus geometricus*) is a medium-sized spider recognizable by its mottled brown and tan abdomen often featuring a distinctive orange-yellow hourglass marking on the underside. Unlike the black widow, its overall coloration is lighter and more variable. They construct tangled, irregular webs often found in secluded locations around human structures, such as sheds, garages, and outdoor furniture.  These spiders play a beneficial role in controlling insect populations, feeding on flies, mosquitoes, and other small invertebrates. While their venom is neurotoxic, it is generally less potent than that of the black widow, making bites less life-threatening, though medical attention is still advised."
  },
  {
    "Common Name": "Brown Recluse Spider",
    "Scientific Name": "Loxosceles reclusa",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Will attempt to flee, but may bite if cornered or pressed against the skin (e.g., in clothing).",
    "If Attacked": "Seek immediate medical attention.  Try to capture the spider for identification.",
    "Category": "Spider (Arachnid - not specifically listed in provided categories)",
    "Endemic": "No (Not found in Sri Lanka)",
    "Region": "N/A",
    "Venom Type": "Hemotoxic (Necrotic)",
    "Description": "The brown recluse spider is a small, light brown spider with a characteristic dark, violin-shaped marking on its back. It prefers dark, undisturbed areas like woodpiles, sheds, and closets. Its venom is necrotic, meaning it causes tissue death around the bite area. While not usually aggressive, its bite can lead to serious medical complications. Its ecological role involves controlling insect populations."
  },
  {
    "Common Name": "Funnel-web Spiders",
    "Scientific Name": "Atrax robustus",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "When agitated, these spiders raise their front legs and display their fangs, ready to strike.",
    "If Attacked": "Seek immediate medical attention. Antivenom is available for some species.",
    "Category": "Spider (Not listed in your provided options, but the most accurate category)",
    "Endemic": "Data insufficient to confirm endemic status for all Sri Lankan funnel-web species. Some are likely endemic while others may have wider distributions.",
    "Region": "Found throughout the island, including forested areas and human settlements.",
    "Venom Type": "Neurotoxic",
    "Description": "Sri Lankan funnel-web spiders, belonging to the family Hexathelidae, are a group of diverse species.  They construct funnel-shaped webs, often in crevices, burrows, or amongst foliage. These webs serve as traps for prey, primarily insects and other small invertebrates.  Their neurotoxic venom can be dangerous to humans, causing severe pain, muscle spasms, and in rare cases, death if left untreated. They play a crucial role in controlling insect populations within their ecosystems.  Accurate species identification is crucial for proper medical treatment."
  },
  {
    "Common Name": "Indian Red Scorpion   'White Scorpion'",
    "Scientific Name": "Hottentotta tamulus",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Becomes highly aggressive, raises its tail in a threatening posture and may strike repeatedly.",
    "If Attacked": "Seek immediate medical attention. Antivenom is available and crucial for survival. Immobilize the affected limb and minimize movement. Traditional remedies are not effective and can delay essential treatment.",
    "Category": "Scorpion",
    "Endemic": "No",
    "Region": "Dry and arid regions, especially North Western, Northern, and parts of Eastern provinces.",
    "Venom Type": "Neurotoxic",
    "Description": "The Indian red scorpion (*Hottentotta tamulus*), also sometimes mistakenly called 'White Scorpion' due to color variations, is one of the most medically significant scorpion species in South Asia, including Sri Lanka.  It is a small to medium-sized scorpion, typically reddish-brown to orange-brown in color, with robust pincers and a slender, segmented tail ending in a potent stinger. It inhabits dry, arid areas, often hiding under rocks, logs, and in crevices within human dwellings.  This scorpion is primarily nocturnal, preying on insects and other small invertebrates. Its venom is highly neurotoxic and can be fatal to humans, particularly children and the elderly, if not treated promptly.  While it plays a role in controlling insect populations, its venomous nature poses a significant health risk."
  },
  {
    "Common Name": "Giant Forest Scorpion",
    "Scientific Name": "Heterometrus swammerdami",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Raises its tail and pincers in a defensive posture, may strike if provoked further.",
    "If Attacked": "Wash the affected area with soap and water. Apply a cold compress. Seek medical attention if symptoms persist or worsen.",
    "Category": "Scorpion",
    "Endemic": "Yes",
    "Region": "Throughout the island, particularly in forested areas and near human settlements.",
    "Venom Type": "Mild, primarily causes localized pain and swelling.",
    "Description": "The Giant Forest Scorpion ( *Heterometrus swammerdami* ) is one of the largest scorpions in the world, reaching lengths of up to 20 cm. It is a predominantly black or dark brown arachnid with robust pincers and a segmented tail ending in a stinger. This scorpion inhabits a variety of terrestrial ecosystems in Sri Lanka, including rainforests, dry forests, and even modified landscapes around human dwellings. It is primarily nocturnal, preying on insects, spiders, and other small invertebrates. Although its sting is painful, it poses little threat to humans unless allergic reactions occur. It plays a vital role in controlling invertebrate populations within its ecosystem."
  },
  {
    "Common Name": "Other Scorpion Species (Isometrus spp., Lychas spp., Reddyanus spp.)",
    "Scientific Name": "Various",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Becomes defensive, raises tail and pincers. May strike repeatedly if provoked.",
    "If Attacked": "Seek medical attention, especially if symptoms worsen. Though rarely serious, allergic reactions are possible. Clean the wound with antiseptic soap and water.",
    "Category": "Scorpion",
    "Endemic": "Yes and No (Some species are endemic, others are not)",
    "Region": "Island-wide, various habitats.",
    "Venom Type": "Mild, primarily localized pain and swelling.",
    "Description": "Several scorpion genera, including *Isometrus*, *Lychas*, and *Reddyanus*, are found throughout Sri Lanka, inhabiting diverse environments from forests and grasslands to urban areas. These scorpions are generally small to medium-sized with varying coloration, often brownish or yellowish.  While they possess venom primarily used for subduing prey like insects and small invertebrates, their sting is typically not dangerous to humans, causing localized pain, swelling, and possibly mild numbness. Some species are endemic to Sri Lanka, playing a crucial role in controlling insect populations within their respective ecosystems, while others are more widespread."
  },
  {
    "Common Name": "Stonefish",
    "Scientific Name": "Synanceia verrucosa",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Remains motionless and relies on camouflage; may envenomate if stepped on or touched.",
    "If Attacked": "Seek immediate medical attention. Hot water immersion of the affected area can provide some pain relief. Antivenom is available.",
    "Category": "Fish",
    "Endemic": "No",
    "Region": "Coastal waters around Sri Lanka",
    "Venom Type": "Neurotoxic and Hemotoxic",
    "Description": "The stonefish ( *Synanceia verrucosa* ) is a master of camouflage, blending seamlessly with rocky or coral reefs in shallow coastal waters of Sri Lanka. Its dorsal spines contain highly potent venom delivered through needle-like tips. Primarily piscivorous, it lies in wait to ambush unsuspecting prey.  Contact with its spines can be extremely painful and even fatal to humans if not treated promptly. Though not actively aggressive, its cryptic nature and powerful venom make it a significant hazard. Its presence plays a role in controlling populations of small fish and crustaceans in its habitat."
  },
  {
    "Common Name": "Lionfish",
    "Scientific Name": "Pterois volitans",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Raises dorsal spines and may attempt to sting.",
    "If Attacked": "Seek immediate medical attention. Submerge the affected area in hot (not scalding) water, as heat can denature the venom.",
    "Category": "Fish",
    "Endemic": "No",
    "Region": "Coastal waters around Sri Lanka",
    "Venom Type": "Neurotoxic",
    "Description": "The lionfish ( *Pterois volitans* ) is a striking, invasive fish species found in the coastal waters of Sri Lanka.  Recognizable by its flamboyant, venomous spines and reddish-brown and white stripes, it inhabits coral reefs, rocky areas, and seagrass beds.  Lionfish are voracious predators, disrupting local ecosystems by consuming vast quantities of smaller fish and crustaceans.  Their venomous spines pose a significant threat to humans, causing intense pain, swelling, and potential systemic effects. While not native, they have become established in the region, posing a challenge to native biodiversity."
  },
  {
    "Common Name": "Scorpionfish",
    "Scientific Name": "Scorpaenopsis oxycephala",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Remains motionless, relying on camouflage, may erect dorsal spines if further threatened.",
    "If Attacked": "Seek immediate medical attention. The venom can cause intense pain, swelling, and potentially serious systemic effects.",
    "Category": "Fish",
    "Endemic": "No",
    "Region": "Coastal waters around Sri Lanka",
    "Venom Type": "Hemotoxic and Neurotoxic",
    "Description": "The Scorpionfish ( *Scorpaenopsis oxycephala* ) is a master of camouflage, blending seamlessly with the coral reefs and rocky substrates of Sri Lanka's coastal waters.  Covered in cryptic coloring and textured skin with fleshy appendages, it lies in wait for unsuspecting prey. Its dorsal, anal, and pelvic spines are equipped with venom glands, delivering a potent mixture of hemotoxins and neurotoxins. While not aggressive, it will inject venom defensively if stepped on or harassed. This slow-moving predator plays a crucial role in controlling populations of smaller fish and crustaceans within the reef ecosystem."
  },
  {
    "Common Name": "Catfish (Plotosus lineatus)",
    "Scientific Name": "Plotosus lineatus",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Becomes aggressive, raises dorsal and pectoral fins, may lunge or dart towards perceived threats.",
    "If Attacked": "Seek immediate medical attention. The venom can be extremely painful and potentially fatal.",
    "Category": "Fish (not listed in provided options, closest is Amphibian though inaccurate)",
    "Endemic": "No",
    "Region": "Coastal waters, estuaries, and lagoons around Sri Lanka.",
    "Venom Type": "Neurotoxic and Hemolytic",
    "Description": "The Striped Eel Catfish ( *Plotosus lineatus*) is a distinctive fish with a long, eel-like body and prominent barbels around the mouth.  Juveniles are black with bright yellow or white stripes, while adults become more uniformly dark. They inhabit marine and brackish waters, often found in sandy or muddy bottoms and among coral reefs.  Highly venomous spines on the dorsal and pectoral fins deliver a potent sting that can cause excruciating pain and even death in humans.  They play a role as predators of small invertebrates and fish, contributing to the complex food web of their ecosystem.  Their venomous nature makes them a significant hazard to humans, especially fishermen and waders."
  },
  {
    "Common Name": "Sri Lankan Painted Frog   Bullfrog",
    "Scientific Name": "Kaloula taprobanica",
    "Poison Level": "Non-Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Inflates its body, may secrete a sticky, irritating skin secretion.",
    "If Attacked": "Wash the affected area thoroughly with soap and water.",
    "Category": "Amphibian",
    "Endemic": "Yes",
    "Region": "Throughout the island, including dry and intermediate zones.",
    "Venom Type": "None",
    "Description": "The Sri Lankan Painted Frog ( *Kaloula taprobanica*), also called the Sri Lankan Bullfrog, is a robust, round frog characterized by its smooth, often brightly colored skin, which can vary from shades of brown and gray to reddish-orange with dark markings. It inhabits a range of environments, including forests, grasslands, and even urban areas, preferring to burrow in loose soil or hide under leaf litter. Primarily nocturnal, it emerges to feed on insects and other invertebrates, playing a vital role in controlling invertebrate populations. During the breeding season, which coincides with the monsoons, they gather in temporary pools and flooded areas to reproduce. Though capable of inflating their bodies and secreting irritating substances when threatened, they pose no significant danger to humans."
  },
  {
    "Common Name": "Atukorale's Dwarf Toad",
    "Scientific Name": "Duttaphrynus atukoralei",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May secrete bufotoxins from parotoid glands behind the eyes.  Likely to try to hop away.",
    "If Attacked": "Wash exposed skin thoroughly with soap and water.",
    "Category": "Amphibian",
    "Endemic": "Yes",
    "Region": "Central",
    "Venom Type": "Mild",
    "Description": "Atukorale's Dwarf Toad ( *Duttaphrynus atukoralei* ) is a small, terrestrial toad endemic to the Knuckles Mountain Range in central Sri Lanka.  It is characterized by its relatively smooth, brown skin with darker markings, and a distinctive pointed snout.  This toad inhabits moist leaf litter and forest floor habitats within its restricted range.  Like other toads, it plays a vital role in the ecosystem by controlling insect populations.  Its secretions are mildly irritating to human skin but pose no serious threat unless ingested or introduced to mucous membranes."
  },
  {
    "Common Name": "Velvet Ant (wingless wasp)",
    "Scientific Name": "Mutillidae spp.",
    "Poison Level": "Highly Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "Becomes highly active, may run erratically or curl into a defensive posture.  Produces a squeaking or chirping sound.",
    "If Attacked": "Avoid contact. If stung, apply ice and seek medical advice if necessary due to the potential for allergic reactions.",
    "Category": "Wasp (Hymenoptera)",
    "Endemic": "No",
    "Region": "Island-wide distribution, various habitats.",
    "Venom Type": "Mildly Hemolytic",
    "Description": "Velvet ants are not true ants, but rather a family of wingless wasps (Mutillidae).  The females are ground-dwelling and resemble hairy ants, often with bright aposematic coloration (red, orange, yellow) warning of their potent sting. They are solitary parasitoids, meaning they lay their eggs in the nests of other insects (bees, wasps, other ground-nesting insects), and their larvae consume the host's larvae or pupae. They inhabit a wide range of habitats in Sri Lanka, including forests, grasslands, and even urban areas.  Their role in the ecosystem is primarily as a regulator of other insect populations. While their sting is considered one of the most painful among insects, they are not aggressive unless provoked, and fatalities are extremely rare."
  },
  {
    "Common Name": "Giant Centipede",
    "Scientific Name": "Scolopendra hardwickei",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Becomes highly aggressive, raises its front legs and head, and may strike repeatedly.",
    "If Attacked": "Seek immediate medical attention.  Traditional remedies are not recommended.",
    "Category": "None (Myriapod - Centipede)",
    "Endemic": "No",
    "Region": "Throughout the island, particularly in lowland rainforests and moist areas.",
    "Venom Type": "Hemotoxic",
    "Description": "The Giant Centipede ( *Scolopendra hardwickei*), instantly recognizable by its striking orange and black bands, is a formidable predator in Sri Lanka's ecosystems. These nocturnal hunters can reach impressive lengths and possess powerful forcipules (modified front legs) that deliver a painful, venomous bite.  Their venom primarily affects the cardiovascular and nervous systems, causing localized swelling, intense pain, and potentially systemic effects. They play a crucial role in controlling insect populations, inhabiting leaf litter, under logs, and within crevices in damp environments. While they usually avoid confrontation, they will readily defend themselves if provoked."
  },
  {
    "Common Name": "Hornets",
    "Scientific Name": "Vespa affinis",
    "Poison Level": "Moderately Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "Becomes highly aggressive, swarming and stinging repeatedly.",
    "If Attacked": "Cover your head and face and move quickly away from the nest area. Seek medical attention if stung multiple times or if experiencing allergic reactions.",
    "Category": "Insect (Hymenoptera - wasp family)",
    "Endemic": "No",
    "Region": "Throughout the island, common in urban and rural areas.",
    "Venom Type": "Mild, primarily causing pain and localized swelling, though severe reactions can occur.",
    "Description": "The *Vespa affinis* hornet is a social insect, building large paper nests often found in trees, under eaves, or within cavities.  They are robust wasps, with a predominantly black body marked with bands of orange-yellow.  They play a role in the ecosystem as predators of other insects, contributing to natural pest control, but can also pose a threat to honeybee populations.  Their stings, while painful, are not typically life-threatening unless the individual is allergic or receives multiple stings."
  },
  {
    "Common Name": "Wasps",
    "Scientific Name": "Polistes spp.",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "Become highly aggressive, fly erratically, and may sting repeatedly.",
    "If Attacked": "Move away slowly and calmly. Avoid swatting. Seek medical attention if allergic or experiencing severe symptoms.",
    "Category": "Insect (Note: the given categories don't include insects, so this is the most appropriate fit)",
    "Endemic": "No",
    "Region": "Island-wide distribution across various habitats.",
    "Venom Type": "Mild, primarily causing localized pain and swelling.",
    "Description": "*Polistes* wasps in Sri Lanka are social insects, constructing papery nests from chewed plant fibers, typically found attached to tree branches, eaves, or rock overhangs.  They display a diverse array of colors and patterns depending on the species. These wasps play a crucial role in the ecosystem, acting as both predators of smaller insects (helping control pest populations) and as pollinators while foraging for nectar.  While generally not aggressive unless their nest is disturbed, their stings can be painful, especially for those with allergies.  Different species occupy a range of habitats from forests and grasslands to urban areas."
  },
  {
    "Common Name": "Bees",
    "Scientific Name": "Apis cerana",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Become more active, fly erratically, and may try to sting if they perceive a threat to their hive.",
    "If Attacked": "Move slowly and calmly away from the area. Avoid swatting at them as this may further agitate them.",
    "Category": "Insect (Technically not one of the provided categories, but the closest fit)",
    "Endemic": "No",
    "Region": "Island-wide",
    "Venom Type": "Mild",
    "Description": "The Asian honey bee ( *Apis cerana*) is a small, social bee species found throughout Sri Lanka, inhabiting diverse habitats from forests and urban areas to agricultural landscapes. They are vital pollinators, contributing significantly to the reproduction of numerous plant species, both wild and cultivated, thus playing a crucial role in maintaining biodiversity and agricultural productivity.  These bees build nests in cavities, such as tree hollows and rock crevices, constructing multiple combs to store honey and raise their young. While generally docile, they will defend their hive aggressively if disturbed, inflicting a mildly painful sting. Their honey and beeswax are valued resources, contributing to local livelihoods."
  },
  {
    "Common Name": "Fire Ants",
    "Scientific Name": "Solenopsis spp.",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "Become highly aggressive, swarming and stinging repeatedly.",
    "If Attacked": "Brush them off quickly, avoid crushing them against skin. Wash the affected area with soap and water. Apply a cold compress. Seek medical attention if symptoms worsen or an allergic reaction occurs.",
    "Category": "Insect (Note: While the provided categories don't include insects, this is the correct classification)",
    "Endemic": "No",
    "Region": "Island-wide distribution",
    "Venom Type": "Mild, primarily causing local pain and inflammation.",
    "Description": "Fire ants (Solenopsis spp.) are small, reddish-brown ants known for their aggressive behavior and painful sting.  Several invasive species are present in Sri Lanka, commonly found in disturbed areas, gardens, and agricultural lands.  They build nests in soil, often forming mounds.  Their venom causes a burning sensation, hence the name \"fire ant.\"  While not typically life-threatening, their stings can be problematic for sensitive individuals.  Ecologically, they act as both predators and scavengers, impacting invertebrate populations and nutrient cycling.  Their presence can also disrupt agricultural practices."
  },
  {
    "Common Name": "Bulldog Ants   Giant Ants",
    "Scientific Name": "Myrmecia spp.",
    "Poison Level": "Highly Venomous",
    "Danger Level": "High",
    "Behavior (Agitated)": "Highly aggressive, known to chase intruders over considerable distances, jumping and snapping their mandibles.",
    "If Attacked": "Back away slowly and carefully. Seek immediate medical attention if stung.",
    "Category": "Insect (Ant)  *(Note: While not a listed category, providing most accurate category)*",
    "Endemic": "No",
    "Region": "Not found in Sri Lanka.  *(Note:  Myrmecia is an Australian genus.)*",
    "Venom Type": "Neurotoxic and Myotoxic",
    "Description": "Bulldog ants (Myrmecia spp.) are a genus of large, aggressive ants endemic to Australia, not Sri Lanka. They are characterized by their powerful mandibles, excellent vision, and potent venom which can cause anaphylactic shock in humans. These ants are typically found in open forests and woodlands where they are active hunters of insects and other small invertebrates.  They play an important role in controlling invertebrate populations in their ecosystems. They build nests in the soil, often under logs or rocks."
  },
  {
    "Common Name": "Processionary Caterpillars",
    "Scientific Name": "Thaumetopoea spp.",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Moderate",
    "Behavior (Agitated)": "When disturbed, they raise their heads and front body segments in a defensive posture.",
    "If Attacked": "Avoid touching them directly. If contact occurs, wash the affected area thoroughly with soap and water and seek medical advice if irritation persists.",
    "Category": "Insect (Lepidoptera - moth larvae)",
    "Endemic": "No (although specific *species* may be)",
    "Region": "Island-wide, various habitats",
    "Venom Type": "Mild (urticating hairs causing skin irritation and allergic reactions)",
    "Description": "Processionary caterpillars in Sri Lanka, of the genus *Thaumetopoea*, are known for their distinctive habit of moving in nose-to-tail processions. These hairy caterpillars are often found on various host trees, where they feed on leaves. Their hairs are covered in a mildly irritating substance that can cause skin rashes, itching, and allergic reactions in humans.  While not highly venomous, their pervasive presence and potential to trigger reactions pose a moderate threat. They play a role in the ecosystem as prey for birds and other insectivores, while their feeding activity can contribute to defoliation of host plants."
  },
  {
    "Common Name": "Tiger Beetle Larvae",
    "Scientific Name": "Cicindelinae (larvae)",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "If disturbed, the larva will rapidly retreat into its burrow.  It may also make snapping motions with its mandibles.",
    "If Attacked": "Brush the larva away.  Wash the affected area with soap and water.",
    "Category": "Insect (Larvae of Beetle)",
    "Endemic": "Some species are, others are not.  (Cicindelinae is a large subfamily.)",
    "Region": "Island-wide, various habitats.",
    "Venom Type": "Mild, primarily for subduing prey.",
    "Description": "Tiger beetle larvae are predatory insects that live in vertical burrows in the soil, often in open, sunny areas.  They are ambush predators, waiting at the top of their burrow with their large, sickle-shaped mandibles open.  When prey comes near, the larva strikes with lightning speed, injecting a mild venom to paralyze its victim.  They are an important part of the ecosystem, helping to control populations of other insects.  They can be identified by their cream-colored, segmented body with a distinct head and large mandibles.  They have hooks on their abdomen that help anchor them in their burrows."
  },
  {
    "Common Name": "Blister Beetles",
    "Scientific Name": "Meloidae spp.",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "When disturbed, they secrete a blistering agent (cantharidin) from leg joints as a defense mechanism.",
    "If Attacked": "Wash the affected area thoroughly with soap and water. Avoid touching your eyes or other sensitive areas after handling them. Seek medical attention if a large area is affected or if symptoms worsen.",
    "Category": "Insect (Beetle)",
    "Endemic": "No",
    "Region": "Island-wide distribution in various habitats.",
    "Venom Type": "Mild (Cantharidin - a blistering agent)",
    "Description": "Blister beetles (Meloidae spp.) are a diverse group of beetles found throughout Sri Lanka.  They vary in size and coloration but are often recognized by their elongated bodies and relatively soft elytra (wing covers). They inhabit a range of environments including grasslands, forests, and agricultural areas.  Blister beetles are herbivores, feeding on plants and sometimes crops.  Their larvae parasitize other insects, particularly bees and grasshoppers, playing a role in regulating insect populations.  The cantharidin they produce serves as a powerful defense against predators but can cause skin blisters in humans upon contact."
  },
  {
    "Common Name": "Assassin Bugs",
    "Scientific Name": "Reduviidae spp.",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May become aggressive and attempt to bite if disturbed or handled roughly.",
    "If Attacked": "Wash the affected area thoroughly with soap and water. Seek medical attention if symptoms persist or worsen.",
    "Category": "Insect",
    "Endemic": "No",
    "Region": "Island-wide distribution across various habitats.",
    "Venom Type": "Mild, primarily for subduing prey.",
    "Description": "Assassin bugs (Reduviidae spp.) are a diverse group of predatory insects found throughout Sri Lanka. These insects are characterized by their elongated bodies, narrow heads, and curved rostrum (beak-like mouthpart) used to inject venom and enzymes into their prey.  They inhabit a variety of ecosystems, from forests and grasslands to agricultural lands and even urban areas.  Assassin bugs play a crucial role in controlling insect populations, preying on other insects, spiders, and sometimes small vertebrates. While their bite can be painful to humans, it's typically not medically significant unless an individual is allergic. Their coloration varies greatly between species, ranging from cryptic browns and greens to vibrant warning colors."
  },
  {
    "Common Name": "Millipedes (irritating fluids)",
    "Scientific Name": "Various spp.",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "Curls into a coil and secretes irritating fluids.",
    "If Attacked": "Wash the affected area thoroughly with soap and water. Seek medical attention if irritation persists.",
    "Category": "Invertebrate (Myriapod)",
    "Endemic": "Some species are endemic, others are not.",
    "Region": "Island-wide distribution in various habitats.",
    "Venom Type": "Mild, irritating chemicals (not true venom).",
    "Description": "Sri Lankan millipedes are diverse, ranging from small, inconspicuous species to larger, more robust ones.  They are characterized by their numerous legs and cylindrical body segments.  Inhabiting a variety of ecosystems, including forests, grasslands, and even urban gardens, millipedes play an essential role as detritivores, breaking down decaying organic matter and contributing to nutrient cycling.  When threatened, they often coil up as a defense mechanism and secrete irritating fluids containing benzoquinones and other chemicals, which can cause skin irritation, burning, and discoloration.  While not truly venomous, these defensive secretions can be unpleasant for humans."
  },
  {
    "Common Name": "False Widow Spiders",
    "Scientific Name": "Steatoda spp.",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "When disturbed, they may retreat, display a threat posture by raising their front legs, or bite if they feel threatened.",
    "If Attacked": "Wash the bite area with soap and water. Apply a cold compress. Seek medical attention if symptoms worsen or persist.",
    "Category": "Spider (Arachnid)",
    "Endemic": "No",
    "Region": "Island-wide distribution",
    "Venom Type": "Mild, primarily neurotoxic",
    "Description": "False widow spiders (Steatoda spp.) are a group of spider species found across Sri Lanka, often mistaken for the more dangerous black widow. They are typically dark-colored, often with brownish or purplish hues and sometimes with pale markings. These spiders create tangled webs in sheltered locations like crevices, under rocks, or within human dwellings. They play a role in controlling insect populations, preying on flies, mosquitoes, and other small invertebrates. Their bite, while usually not medically significant for humans, can cause localized pain, redness, and swelling, similar to a bee sting. Some individuals may experience mild systemic effects like nausea or headaches."
  },
  {
    "Common Name": "Wolf Spiders",
    "Scientific Name": "Lycosidae spp.",
    "Poison Level": "Mildly Venomous",
    "Danger Level": "Low",
    "Behavior (Agitated)": "May raise front legs in a defensive posture and attempt to bite if cornered or provoked.",
    "If Attacked": "Wash the bite area with soap and water. Apply a cold compress. Seek medical attention if symptoms worsen or allergic reactions occur.",
    "Category": "Arachnid (Although not listed, this is the appropriate category)",
    "Endemic": "No",
    "Region": "Island-wide",
    "Venom Type": "Mild, mainly localized pain and swelling.",
    "Description": "Wolf spiders are a diverse family (Lycosidae) of hairy, ground-dwelling arachnids found throughout Sri Lanka, typically in grasslands, forests, and home gardens.  They are robust, agile hunters, actively pursuing prey rather than building webs. Their excellent eyesight, derived from eight eyes arranged in three rows, aids in hunting insects and other small invertebrates.  They play a crucial role in controlling insect populations, contributing to the balance of the ecosystem. Female wolf spiders are known for their maternal care, carrying their egg sacs attached to their spinnerets and later carrying their young on their backs."
  }
]